[
  {
    "Content": "A new blog, a clean slate! What it will become ... who knows?\n\nThe reasons for this blog are multiple;\n\u0026lt;ul\u0026gt;\n\t\u0026lt;li\u0026gt;I\u0026#39;ve deleted my personal profile from Facebook\n\u0026lt;ul\u0026gt;\n\t\u0026lt;li\u0026gt;This was before the \u0026lt;a href=\u0026quot;https://www.theguardian.com/uk-news/2018/mar/22/cambridge-analytica-scandal-the-biggest-revelations-so-far\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener\u0026quot;\u0026gt;Cambridge Analytica\u0026lt;/a\u0026gt; scandal, I was just fed up with all junk in my feed\u0026lt;/li\u0026gt;\n\u0026lt;/ul\u0026gt;\n\u0026lt;/li\u0026gt;\n\t\u0026lt;li\u0026gt;I was offered a .me domain name at a good price during a Black Friday event\u0026lt;/li\u0026gt;\n\t\u0026lt;li\u0026gt;I have thoughts I\u0026#39;d like to share and think that some people may enjoy reading them because they agree or because they don\u0026#39;t and can (hopefully) have a constructive discussion to see if then can put me right ;-)\u0026lt;/li\u0026gt;\n\u0026lt;/ul\u0026gt;\nI often find myself ranting at the TV, complaining about the state of the UK and the world in general which generally irritates my wife. Well, now I can do all that here, even though nobody is probably listening (just like my wife) but at least I\u0026#39;ll feel that I\u0026#39;ve said my piece and that someone may by entertained, or even enlightened - but lets not get ahead of ourselves.\n\nBut don\u0026#39;t worry, it won\u0026#39;t all be doom and gloom (there\u0026#39;s enough of that going around) I hope to be sharing the good stuff too.\n\nMy intention was to make a start in the New Year, not a resolution you understand, just a thought. As it is, with BREXIT, \u0026lt;a href=\u0026quot;https://www.bbc.co.uk/news/world-australia-46463029\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener\u0026quot;\u0026gt;Australia passing a law to force backdoors into encryption\u0026lt;/a\u0026gt;, I think I\u0026#39;ll be starting a few weeks early.\n\nOne thing I will say from the outset; these are my views and I have a right to them, just as you have a right to yours. If you don\u0026#39;t like what I write then don\u0026#39;t read it - simple as that.",
    "Id": "23",
    "Permalink": "http://davecarson.me/2018/12/14/so-here-were-all-are/",
    "Created": "2018-12-14T13:39:12.0000000+00:00",
    "Author": "Dave Carson",
    "Title": "So here were all are....",
    "Categories": [
      "General"
    ]
  },
  {
    "Content": "\u0026lt;img class=\u0026quot; size-full wp-image-37 aligncenter\u0026quot; src=\u0026quot;https://davecarsonme.files.wordpress.com/2018/12/hate-job.jpg\u0026quot; alt=\u0026quot;hate job\u0026quot; width=\u0026quot;640\u0026quot; height=\u0026quot;426\u0026quot; /\u0026gt;\n\nWe all have those friends who, on a night out, will whine and moan about their jobs. They don\u0026#39;t like their manager, so and so is a bitch and they could manage the place better.\n\nWhen I\u0026#39;m on the receiving end of one of these I roll out my personal mantra:\n\u0026lt;blockquote\u0026gt;If you don\u0026#39;t like what you do, then do something else,\n\nIf you like what you do but not where you do it, do it somewhere else\u0026lt;/blockquote\u0026gt;\nWe spend a lot of time working and doing a job you don\u0026#39;t like is just a waste of time for all concerned; you, your colleagues, your employer and the people around you.\n\nNow that may all sound very flippant, but that\u0026#39;s how I\u0026#39;ve gotten to where I am today.\n\nWhen I left school I trained as a Motor Mechanic but after 7 years or so that wasn\u0026#39;t doing it for me.\n\nI then had an opportunity to enrol on a Mechanical Engineering degree and despite a number of people telling me I probably wasn\u0026#39;t smart enough I grabbed the chance. I gradated and now have a BEng honors degree to my name.\n\nNot finding a suitable job in MechEng I decided to fall back on a hobby of mine, computer programming, a skill now sharpened during my degree studies.\n\nI secured my first Software Developer role soon afterwards, moving onto another when I outgrew the first. Then another.\n\nToday I work as a Software Development contractor, picking the work I want to do, the work that interests and challenges me, and passing on the rest.\n\nI find it hard to see what I do as \u0026#39;work\u0026#39; sometimes - I enjoy it that much. Yes I have difficult days like everyone else; be it the code I\u0026#39;m working on, the people I\u0026#39;m working with or the client I\u0026#39;m working for. But I can see some many positives in what I do that these things are just blips - and I can live with those.\n\nI\u0026#39;ve declined contract renewals because the projects weren\u0026#39;t doing it for me, or because because the client was just too difficult to work for.\n\nI\u0026#39;ve taken lower paid contracts for more interesting work and travelled further on a commute than I ever wanted to for projects and clients that are engaging and fulfilling.\n\n\u0026lt;a href=\u0026quot;https://www.youtube.com/watch?v=agbsQbMi7x0\u0026quot;\u0026gt;\u0026lt;img class=\u0026quot; size-full wp-image-34 alignright\u0026quot; src=\u0026quot;https://davecarsonme.files.wordpress.com/2018/12/what_do_you_desire-youtube.png\u0026quot; alt=\u0026quot;what_do_you_desire-youtube\u0026quot; width=\u0026quot;251\u0026quot; height=\u0026quot;144\u0026quot; /\u0026gt;\u0026lt;/a\u0026gt;\n\nI recently came across a \u0026lt;a href=\u0026quot;https://www.youtube.com/watch?v=agbsQbMi7x0\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener\u0026quot;\u0026gt;motivational video on\u0026#194;\u0026#160;\u0026lt;/a\u0026gt;\u0026lt;a href=\u0026quot;https://www.youtube.com/watch?v=agbsQbMi7x0\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener\u0026quot;\u0026gt;YouTube by Alan Watts which entitled \u0026#39;What do you desire?\u0026#39;\u0026lt;/a\u0026gt;. I encourage you to watch it - it could be the most enlightening 3 minutes you spend today.",
    "Id": "30",
    "Permalink": "http://davecarson.me/2018/12/16/dont-complain-to-me-about-your-job/",
    "Created": "2018-12-16T15:26:48.0000000+00:00",
    "Author": "Dave Carson",
    "Title": "Don\u0026#39;t complain to me about your job.....",
    "Categories": [
      "Alan Watts",
      "Career",
      "Life",
      "Motivational"
    ]
  },
  {
    "Content": "\u0026lt;img class=\u0026quot;alignleft size-medium wp-image-41\u0026quot; src=\u0026quot;https://davecarsonme.files.wordpress.com/2018/12/brexit-signpost.jpg?w=300\u0026quot; alt=\u0026quot;\u0026quot; width=\u0026quot;300\u0026quot; height=\u0026quot;169\u0026quot; /\u0026gt;As a resident of the UK it would be laughable to think that\u0026#194;\u0026#160;I didn\u0026#39;t have an opinion on BREXIT!\n\nBefore I start I should say that, like so many others in the UK (and around the world even), I have little interest in politics - or politicians for that matter. I feel that on the whole they are a bunch of self-interested, arrogant, power hungry muppets with their own welfare pushed well ahead of the rest of ours. Watching the House of Commons on the TV just makes me mad when I see these people laughing, jeering and waving their bits of paper around. It\u0026#39;s like a school playground in there and I sometimes wonder what the politicians of old would make of their carrying on. Maybe that\u0026#39;s the way it\u0026#39;s always been.\n\nAnyway, back to the matter in hand - BREXIT! The desire of just over half of the UK population who bothered their arse to vote decided that the UK should leave the EU and \u0026#39;Take Back Control\u0026#39;. Those who didn\u0026#39;t vote lost their voice and as far as I\u0026#39;m concerned should keep their opinions to themselves on all matters BREXIT - you had your chance and you dropped the ball!\n\nFor what it\u0026#39;s worth, I voted to REMAIN in the EU - which puts me in the \u0026lt;a href=\u0026quot;https://www.statista.com/statistics/567922/distribution-of-eu-referendum-votes-by-age-and-gender-uk/\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener\u0026quot;\u0026gt;majority of men between 25 and 49\u0026lt;/a\u0026gt; (I was when I voted!) voted to REMAIN. I\u0026#39;m glad I\u0026#39;m not in the age bracket that voted to LEAVE and plunged the UK into such turmoil. A lot of youngsters are pointing fingers at us, more mature citizens, blaming us for the shambles that we now face - I happy to say \u0026quot;Not Me!\u0026quot;.\n\nWhy did I vote to remain?\u0026lt;img class=\u0026quot;alignright size-thumbnail wp-image-42\u0026quot; src=\u0026quot;https://davecarsonme.files.wordpress.com/2018/12/i-voted-leave.jpg?w=147\u0026quot; alt=\u0026quot;\u0026quot; width=\u0026quot;147\u0026quot; height=\u0026quot;150\u0026quot; /\u0026gt;\n\nWas it an rock solid belief that being in the EU was the absolute best thing for the UK and that we couldn\u0026#39;t manage on our own? Hell No!\n\nThe reason is two fold\n\u0026lt;ol\u0026gt;\n \t\u0026lt;li\u0026gt;I had no faith in the government to be able to negotiate a deal of this magnitude with the EU - and and that\u0026#39;s not to say that the other parties could have don\u0026#39;t a better job in my opinion.\u0026lt;/li\u0026gt;\n \t\u0026lt;li\u0026gt;I really didn\u0026#39;t believe what the politicians and the press were spinning. Sure, there were lies on both sides of the argument and the UK press have to shoulder the blame for good proportion of them. Whipping up fear with sensationalist headlines in order to sell their tatty rags and lead their more gullible readers. Even now, when the General Public can do nothing, we hear things like \u0026#39;if we leave with no deal all flights will be grounded as we can\u0026#39;t fly through EU airspace\u0026#39; while other reports claim this to be scaremongering.\u0026lt;/li\u0026gt;\n\u0026lt;/ol\u0026gt;\nWhy doesn\u0026#39;t everybody see what they are doing - it\u0026#39;s like the \u0026lt;a href=\u0026quot;https://en.wikipedia.org/wiki/The_Emperor%27s_New_Clothes\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener\u0026quot;\u0026gt;Emperor\u0026#39;s New Clothes\u0026lt;/a\u0026gt;. Are we really so blinded that we cannot make a decision for ourselves? Do we really need to follow others who are pushing their lies, all the time having their own, hidden agenda which has little to do with what we, the British people want. I\u0026#39;ll tell you now, the newspaper owners really don\u0026#39;t give a damn about immigration in the UK - but if it helps them make a political point so that they can line their own pockets (and that of their shareholders) then they\u0026#39;ll tell you anything!\n\nI voted REMAIN because I really didn\u0026#39;t believe that the UK government (lower case \u0026#39;g\u0026#39; is not accidental!) was capable of delivering the BREXIT being promised by the LEAVE campaign - and was proved right \u0026lt;a href=\u0026quot;https://www.independent.co.uk/news/uk/politics/eu-referendum-result-nigel-farage-nhs-pledge-disowns-350-million-pounds-a7099906.html\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener\u0026quot;\u0026gt;the very next day when Nigel Farage stated on Good Morning Britain that the claim that \u0026#194;\u0026#163;350m a week would be ploughed into the NHS instead of being paid to the EU was undeliverable\u0026lt;/a\u0026gt; and not a promise he made (despite it being all over the LEAVE campaign bus!). What the absolute ....... !\n\nTo cap it all Farage then announce \u0026#39;his work here was done\u0026#39; and resigned from UKIP. Cameron quit as well. So many voices that were so vocal before were now silenced - probably thinking, \u0026#39;Bloody Hell, we actually won! Now what??\u0026#39;. Quite happy to lead us into something but bailing as soon as the shit hits the fan.\n\nThe REMAIN campaign didn\u0026#39;t cover themselves in glory either preferring to smear the other side instead of providing a proper argument for staying into the EU. Lies, gossip and scaremongering in the place of a constructive argument and, yes I\u0026#39;m going to say it, facts - actual concrete facts, that\u0026#39;s what lost the vote.\n\nTwo years later and were are we? Frankly, in the shit and up to our bloody necks in it! We have a weak prime minister (again, lower case is not a mistake!) who has gone it alone and pussy footed around trying to appease the EU while at home her ministers keep resigning. We have a deal that the EU will grab with both hands and that the UK parliament (lower case for a reason .. I\u0026#39;m sure you get it by now) won\u0026#39;t support. Well Done Mrs May - you have truly done well there!\n\nWe now face the real prospect of a No Deal situation - the worst possible outcome if you believe the politicians and the papers.\n\nIn amongst all this we have politicians on both sides of the house and the argument shovelling more shit and frankly making a bad situation even worse - and for why? For the betterment of the country? I sincerely doubt it.\n\nAt the time of writing Mrs May has fended off a leadership challenge from within her own party and, oddly, I think that was a good thing. Why? Because I like her....no, that\u0026#39;s really not it. Think about it;\n\na) They should really be spending their time doing what they country voted for (as misguided as they may have been) and not stirring the pot for their own end,\n\nb) Who would take over? Gove? Boris? Good grief, out of the frying pan or what!\n\nc) If they did get in what could they do at this late stage in the process - probably nothing. Then all we would hear would be \u0026quot;well, it was already too late for me to save us from this mess\u0026quot; and they would carry on regardless, always bemoaning the fact that they could have done something if only they were in charge earlier.\n\nRight now we are a laughing stock, not only in Europe but around the world. We\u0026#39;ve been show to be weak and compliant and we shall pay dearly for it - not that we already haven\u0026#39;t, I mean how much has all this cost and who is picking up the bill? The UK Taxpayer that\u0026#39;s who.\n\nOf course we will never know what would have happened if the REMAIN campaign had won - only the \u0026#39;winners\u0026#39; write history they say.\n\n\u0026amp;nbsp;",
    "Id": "39",
    "Permalink": "http://davecarson.me/2018/12/21/the-elephant-in-the-room-brexit/",
    "Created": "2018-12-21T09:00:46.0000000+00:00",
    "Author": "Dave Carson",
    "Title": "The Elephant in the Room - BREXIT",
    "Categories": [
      "BREXIT",
      "Politics"
    ]
  },
  {
    "Content": "\u0026lt;a href=\u0026quot;https://www.theguardian.com/business/2018/dec/26/treasury-urged-to-hire-woman-as-bank-of-england-governor\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener\u0026quot;\u0026gt;\u0026lt;img class=\u0026quot;alignleft wp-image-52 size-medium\u0026quot; src=\u0026quot;https://davecarsonme.files.wordpress.com/2018/12/Screenshot_20181226-170254.png?w=150\u0026quot; alt=\u0026quot;\u0026quot; width=\u0026quot;150\u0026quot; height=\u0026quot;300\u0026quot; /\u0026gt;\u0026lt;/a\u0026gt;\n\nThis came into my news feed over Christmas and I have to say that this sort of thing really irritates me.\n\nMPs are \u0026lt;a href=\u0026quot;https://www.theguardian.com/business/2018/dec/26/treasury-urged-to-hire-woman-as-bank-of-england-governor\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener\u0026quot;\u0026gt;calling for the Bank of England to \u0026#39;try harder\u0026#39; to find a female replacement\u0026lt;/a\u0026gt; for the current Governor, Mark Carney in order to help offset the gender imbalance.\n\nWhat ever happened to the \u0026#39;best person for the job getting the job\u0026#39;? If that happens to be a woman then great, hire her and give her the same support as if a man was in the post. But if it happens to be a man - why is that a problem?\n\nYou may say that it\u0026#39;s easy for me to say that because I\u0026#39;m a man but let get something straight here;\n\nI\u0026#39;m one of those people who cannot understand the gender pay gap. If two people are doing the same job with the same responsibilities then they should be paid the same amount for doing it. It becomes a bit of a grey area when salaries increase on a \u0026#39;length of service\u0026#39; basis and in some industries like entertainment when your value may (rightly or wrongly) be judged by your popularity. But on the whole, same job, same responsibilities then same salary - simple.\n\nBy the same measure I also don\u0026#39;t understand why companies need to be forced to hire women over men - sure they need to be reminded that they cannot discriminate between the two sexes but to favour one over the other on the basis of whether they are male or female is just wrong.\n\nThink about it, if you got a job not because you were the best person for it but because the employer had to tick a box to say that \u0026#39;we are reducing the gender imbalance within our company\u0026#39;, how would that make you feel?\n\nBut it won\u0026#39;t stop there will it. If it\u0026#39;s going to be a woman in the role then that will ease the gender imbalance, but what about racial imbalance? So if she is now a non-white woman should she also be gay? What about disabled?\n\nMy answers to those questions are as above - if that person is the best person for the job is a non-white, gay woman in a wheelchair then give it to her and let her get on with it. But if it\u0026#39;s not then surely that\u0026#39;s OK too isn\u0026#39;t it?\n\nBefore you head down to the comments and flame the hell out of my let me reiterate my position;\n\u0026lt;blockquote\u0026gt;Companies need to be reminded that they cannot discriminate against candidates based on their sex, race, sexual orientation, disability etc. Not forced to hire someone in order to tick a box or achieve some arbitrary target set by government.\u0026lt;/blockquote\u0026gt;\nThe best person for the job, that is the person who can do the job the most effectively and bring the most to it, should get the job - period.\n\nTo date it is has been an unfair system that has prevented women from achieving their full potential in the workplace and this is what has created the imbalance - but it seems to me that this isn\u0026#39;t a drive for equality, it\u0026#39;s a drive to reverse the balance.\n\nTwo wrongs don\u0026#39;t make it right!",
    "Id": "51",
    "Permalink": "http://davecarson.me/2018/12/28/the-next-governor-of-the-bank-of-england-should-be-a-woman-why-exactly/",
    "Created": "2018-12-28T11:12:18.0000000+00:00",
    "Author": "Dave Carson",
    "Title": "The next Governor of the Bank of England should be a woman? Why exactly?",
    "Categories": [
      "discrimination",
      "employment",
      "gender",
      "Life",
      "male-female"
    ]
  },
  {
    "Content": "\u0026lt;img class=\u0026quot;  wp-image-58 alignleft\u0026quot; src=\u0026quot;https://davecarsonme.files.wordpress.com/2019/01/grave_stone.jpg\u0026quot; alt=\u0026quot;grave_stone\u0026quot; width=\u0026quot;175\u0026quot; height=\u0026quot;261\u0026quot; /\u0026gt;No? Well then you can\u0026#39;t be a UK resident or if you are then you can\u0026#39;t have a television! Because we are being battered with adverts from the likes of Sun Life and Royal London, always around the time we\u0026#39;re sitting down to relax after work, telling us how expensive funerals are and that it really isn\u0026#39;t right to expect your family to have to think about this when you pass on.\n\nWhile what they say may be true, do we really need it rammed down our throats day after day, week after week, month after month ... I think you get the idea.\n\nSometimes there are two or even three similar adverts in the same break, all reminding \u0026lt;img class=\u0026quot;  wp-image-59 alignright\u0026quot; src=\u0026quot;https://davecarsonme.files.wordpress.com/2019/01/grim-reaper.jpg\u0026quot; alt=\u0026quot;grim-reaper\u0026quot; width=\u0026quot;142\u0026quot; height=\u0026quot;106\u0026quot; /\u0026gt;us that we are \u0026lt;strong\u0026gt;going to die\u0026lt;/strong\u0026gt;. All preying on our fears and hoping that we will pick up the phone and sign up.\n\nI don\u0026#39;t know about you but I really don\u0026#39;t need this sort of thing and it\u0026#39;s no wonder there are so many people suffering depression in this country - and that\u0026#39;s without Brexit.\n\nAre these companies really that desperate for revenue that they need to constantly try to scare the money out of us with these doomful adverts.\n\n\u0026amp;nbsp;",
    "Id": "57",
    "Permalink": "http://davecarson.me/2019/01/20/have-you-thought-about-your-funeral/",
    "Created": "2019-01-20T10:37:24.0000000+00:00",
    "Author": "Dave Carson",
    "Title": "Have you thought about your funeral??",
    "Categories": [
      "Life"
    ]
  },
  {
    "Content": "\u0026lt;img class=\u0026quot;alignleft wp-image-65\u0026quot; src=\u0026quot;https://davecarsonme.files.wordpress.com/2019/01/gmail_logo.png?w=300\u0026quot; alt=\u0026quot;\u0026quot; width=\u0026quot;201\u0026quot; height=\u0026quot;152\u0026quot; /\u0026gt;My personal email account is a GMail account and, naturally enough, hosted by Google. I\u0026#39;ve had this account since around 2005 (13 years at the time of writing) and the mailbox is currently storing almost 5GB of messages.\n\nSo why would I want to move away from Google and lose my @gmail.com account - which all my friends, family have, not to mention sites like Amazon, Ebay and PayPal.\n\nWell, as many users of the Google Inbox app on Android will know, it is being withdrawn in March 2019 and we are being \u0026#39;encouraged\u0026#39; to move back to the \u0026#39;new and improved\u0026#39; Gmail app we were pushed off a few years ago (because Inbox was the way-forward). I received a few nag messages when I opened Inbox so, knowing that there was little point in fighting Google on this, I thought I\u0026#39;d just do it and get it over with.\n\nThe fact is - I don\u0026#39;t like it. Maybe it\u0026#39;s because I have gotten into the Inbox way of doing things. I normally have \u0026#39;\u0026lt;a href=\u0026quot;https://www.fastcompany.com/40507663/the-7-step-guide-to-achieving-inbox-zero-and-staying-there-in-2018\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener\u0026quot;\u0026gt;inbox-zero\u0026lt;/a\u0026gt;\u0026#39; which, let\u0026#39;s face it, was the point of Inbox.\n\n\u0026lt;img class=\u0026quot;size-medium wp-image-64 alignright\u0026quot; src=\u0026quot;https://davecarsonme.files.wordpress.com/2019/01/gmail_app_ads-1.png?w=300\u0026quot; alt=\u0026quot;\u0026quot; width=\u0026quot;300\u0026quot; height=\u0026quot;133\u0026quot; /\u0026gt;I can get over that, I can archive the messages rather than tapping \u0026#39;Done\u0026#39; but this isn\u0026#39;t the thing that\u0026#39;s pushed me to consider moving away altogether - I don\u0026#39;t like the ads which mascarade as email messages.\n\nBefore you head down to the comments and start pointing out that Gmail is free and because of that I\u0026#39;m not a customer I\u0026#39;m the product - yes, I know all that and have accepted that for many, many years. But in todays climate I\u0026#39;m not sure I want to be anymore.\n\nYes, I get all sorts of \u0026quot;benefits\u0026quot; from GMail but I think I can make to without them - at least, I\u0026#39;m prepared to give it a go and see what happens.\n\nSo, I plan to create a new email account using the same provider that I use for my business email, \u0026lt;a href=\u0026quot;https://www.fastmail.com\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener\u0026quot;\u0026gt;Fastmail\u0026lt;/a\u0026gt;. They\u0026#39;ve served me well and $50/year isn\u0026#39;t going to break the bank.\n\n\u0026lt;img class=\u0026quot;alignright size-medium wp-image-67\u0026quot; src=\u0026quot;https://davecarsonme.files.wordpress.com/2019/01/fastmail_logo-1.png?w=300\u0026quot; alt=\u0026quot;\u0026quot; width=\u0026quot;300\u0026quot; height=\u0026quot;183\u0026quot; /\u0026gt;Fastmail provide a \u0026lt;a href=\u0026quot;https://www.fastmail.com/help/account/gmailimport.html\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener\u0026quot;\u0026gt;guide for migrating from GMail\u0026lt;/a\u0026gt; and I plan to follow this to get the up and running. Then I\u0026#39;ll turn off the Gmail account syncing on my phone (incoming mail to the Gmail account will be forwarded to the new account).\n\nThe only wrinkle I can see at the moment is that I already have the Fastmail app on my phone as it is connected to my business email account. I don\u0026#39;t think that this app can support multiple email accounts (as the GMail app can).\n\nOnce I\u0026#39;ve got everything sorted the hard work will start - getting the word out about my new address. Friend and family should be easy enough but what about all those services that are linked to my GMail account?\n\nWell, watch this space - I\u0026#39;ll start with the main services I use, like Amazon, Ebay \u0026amp;amp; PayPal and post my experiences here.\n\nWhen I\u0026#39;m done - hopefully you will be able to decide whether you want to make the leap or not.",
    "Id": "62",
    "Permalink": "http://davecarson.me/2019/01/30/time-to-move-from-gmail/",
    "Created": "2019-01-30T22:41:50.0000000+00:00",
    "Author": "Dave Carson",
    "Title": "Time to move from GMail?",
    "Categories": [
      "Email",
      "Email Migration",
      "Fastmail",
      "GMail",
      "Google",
      "Privacy"
    ]
  },
  {
    "Content": "\u0026lt;img class=\u0026quot;alignleft size-medium wp-image-67\u0026quot; src=\u0026quot;https://davecarsonme.files.wordpress.com/2019/01/fastmail_logo-1.png?w=300\u0026quot; alt=\u0026quot;\u0026quot; width=\u0026quot;300\u0026quot; height=\u0026quot;183\u0026quot; /\u0026gt;Following on from my previous post I have now made some initial progress in my migration away from Gmail and while it\u0026#39;s not the end-game, it is a milestone.\n\nAfter checking that services like Amazon, PayPal the like will not meltdown if I change my password (which is also my username in these cases) I have now registered a new domain name for my email and also signed up for a new \u0026lt;a href=\u0026quot;https://www.fastmail.com\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener noreferrer\u0026quot;\u0026gt;Fastmail\u0026lt;/a\u0026gt; account - wiring the two together by entering the appropriate DNS settings.\n\nWhile it wasn\u0026#39;t strictly speaking necessary for me to have a domain all of my own I did want to retain control of my email. If I had just opted for the standard @fastmail.com domain then if I ever decided to migrate to another service I would have to notify all my contacts and subscribed services again.\n\nThis way my email address is mine and even if I decided to use another provider in the future the address would come with me and nobody else needed to know that I had moved.\n\n\u0026lt;a href=\u0026quot;https://www.fastmail.com\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener noreferrer\u0026quot;\u0026gt;Fastmail\u0026lt;/a\u0026gt; have a great little utility that allowed me to import all my Gmail messages into the new account - placing them into a \u0026#39;migrated\u0026#39; folder for future reference/searching. Because my Gmail account is protected by Two Factor Authentication I did need to create an App Password to allow the \u0026lt;a href=\u0026quot;https://www.fastmail.com\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener noreferrer\u0026quot;\u0026gt;Fastmail\u0026lt;/a\u0026gt; service to connect to my account.\u0026#194;\u0026#160; This was easy enough and you can \u0026lt;a href=\u0026quot;https://support.google.com/accounts/answer/185833?hl=en\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener noreferrer\u0026quot;\u0026gt;read how to create an app password for Gmail here\u0026lt;/a\u0026gt;. I can\u0026#39;t say it was a quick process but then speed wasn\u0026#39;t an issue here and I received an email into the new Inbox when it was completed confirming that almost 50k messages had been imported in around 5 hours.\n\nI also exported my Contacts and Calendar from Google and imported this into my new account. I have to say it was quite enjoyable to run through the contact list and delete those who I really don\u0026#39;t need anymore - it\u0026#39;s amazing the cruft that builds up in there over time. I did need to clean up the contacts a little - some of the names hadn\u0026#39;t come through correctly, e.g. \u0026quot;My Health Centre\u0026quot; just came in as \u0026quot;My Centre\u0026quot;. Easily fixed and all good now.\n\nImporting the Calendar was a little hairy - I managed to stuff it up the first time and ended up with contact birthdays going into the future but not as recurring events - so I could only delete them one at a time. I then noticed that my dental appointment (in a week or so) was not there and the realised that I had imported the wrong file.\n\nThere were two files in the export created by Google and I had imported the \u0026#39;\u0026lt;strong\u0026gt;#contacts@group.v.calendar.google.com.ics\u0026lt;/strong\u0026gt;\u0026#39; file whereas I should have imported the \u0026#39;\u0026lt;strong\u0026gt;\u0026amp;lt;my-email\u0026amp;gt;@gmail.com.ics\u0026lt;/strong\u0026gt;\u0026#39; instead. I\u0026#39;m sure the other file may be useful to others and could have been imported into another calendar (Fastmail allows multiple) but I really didn\u0026#39;t need these events so I left them out. I ended up creating a new Calendar, deleting the original one and then importing the correct file. Happy days so far :-)\n\u0026lt;h3\u0026gt;So where am I now?\u0026lt;/h3\u0026gt;\nI have a fully functional email account, running on my own domain (although you don\u0026#39;t have to) containing all my previous emails, contacts and calendar events.\n\u0026lt;h3\u0026gt;What\u0026#39;s next?\u0026lt;/h3\u0026gt;\nHaving a new email address and not telling anyone is a bit like a broken pencil - pointless. So I now need to notify my contacts that I have a new address (in the full knowledge that many won\u0026#39;t bother up update their address books) and also update my subscribed services like Amazon and PayPal. I\u0026#39;ll let you know how I get on with that in a future post.\n\nAlso, I am currently accessing this account from the Webmail interface but will investigate Desktop and Mobile clients in due course.",
    "Id": "69",
    "Permalink": "http://davecarson.me/2019/02/18/goodbye-gmail-step-1-anyway/",
    "Created": "2019-02-18T15:14:05.0000000+00:00",
    "Author": "Dave Carson",
    "Title": "Goodbye GMail - Step 1 anyway",
    "Categories": [
      "Email Migration",
      "Life",
      "Technology"
    ]
  },
  {
    "Content": "\u0026lt;img class=\u0026quot;wp-image-77 alignleft\u0026quot; src=\u0026quot;https://davecarsonme.files.wordpress.com/2019/02/society_clipart.png\u0026quot; alt=\u0026quot;society_clipart\u0026quot; width=\u0026quot;244\u0026quot; height=\u0026quot;244\u0026quot; /\u0026gt;\n\nSociety, i.e. \u0026lt;span style=\u0026quot;text-decoration:underline;\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;us\u0026lt;/strong\u0026gt;\u0026lt;/span\u0026gt;!\n\nIt shouldn\u0026#39;t come as much of a shock really - the clue is in the title after all!\n\nHowever, the news is currently filled with reports of how Social Media isn\u0026#39;t doing enough to stop bullying and the posting of inappropriate content, such as self-harm, hate speech, mis-information and fake news but whose fault is that really?\n\nThere will always be a minority of the population who will try to exploit the rest for their own gain, whether that\u0026#39;s financial or just self-gratification. It was like it before the Internet let alone Social Media and it will be like it until the Sun consumes this planet (unless we\u0026#39;ve seen ourselves off before then).\n\u0026lt;h2\u0026gt;Facebook fanboy?\u0026lt;/h2\u0026gt;\nNow, I\u0026#39;m not a big fan of Facebook, or any of the social media platforms really, and extricated myself back in early 2018 - a truly liberating experience I can tell you. But I didn\u0026#39;t leave because of anything that Facebook did or didn\u0026#39;t do - I left because I wasn\u0026#39;t really getting anything out of being there.\n\nMy feed was constantly filled with utter drivel and while there were a number of ads dotted around the majority of this crap was being posted by my friends and family - harsh but true.\n\nIs that Facebook\u0026#39;s fault? Could they have saved me from yet another cat meme or Top 10 list of names of the people who are going to die next month - and if they could, should they? Who are they to say what posted, and let\u0026#39;s be clear here - legal, content I should or shouldn\u0026#39;t be interested in.\n\u0026lt;h2\u0026gt;It\u0026#39;s a problem of scale\u0026lt;/h2\u0026gt;\nConsider the fact that in \u0026lt;a href=\u0026quot;http://www.businessofapps.com/data/youtube-statistics/\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener noreferrer\u0026quot;\u0026gt;2018 YouTube users uploaded over 300 hours of content every minute\u0026lt;/a\u0026gt;. Read that again - 300+ hours a minute! Add to this that over a billion hours are watched worldwide everyday and you may see the scale of the problem here - and the problem is scale!\n\nNow, Facebook has more users than YouTube and in \u0026lt;a href=\u0026quot;https://techcrunch.com/2015/11/04/facebook-video-views/\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener noreferrer\u0026quot;\u0026gt;2018 video engagement increased to 8 billion views a day\u0026lt;/a\u0026gt;.\n\nAnd that\u0026#39;s just the video content - imagine how many images have been uploaded while you have been reading this! It\u0026#39;s mind-boggling!\n\nThese platforms have to deal with a scale that most of us cannot even comprehend - but in amongst all those videos of someones cat riding a robotic vacuum cleaner is more disturbing and sinister content (legal and illegal).\n\nBut how do they find this stuff and filter it out before anyone sees it? How do they determine what is appropriate and what is not. Well, they can\u0026#39;t - in real time and at that scale it just isn\u0026#39;t possible, regardless of what the papers will tell you.\n\u0026lt;h2\u0026gt;Surely this can be fixed with Artificial Intelligence\u0026lt;/h2\u0026gt;\nI don\u0026#39;t think AI can save us here and to my mind it is only Real Stupidity that thinks it can at that scale.\n\nJust how can a machine analyse a video in real-time and determine whether it contains hate speech or not?\n\u0026lt;h2\u0026gt;So, what\u0026#39;s my solution?\u0026lt;/h2\u0026gt;\nWell, I don\u0026#39;t have one - maybe there isn\u0026#39;t one and frankly, is there really a problem to be fixed here? This is what happens when you let society express itself. Maybe we are just ashamed of that and want to be seen to be doing something about it.\n\nThere are noises about Social Media platforms being banned in certain countries - \u0026lt;a href=\u0026quot;https://www.independent.co.uk/news/uk/home-news/social-media-ban-uk-instagram-facebook-twitter-molly-russell-death-self-harm-samaritans-a8749121.html\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener noreferrer\u0026quot;\u0026gt;including the UK\u0026lt;/a\u0026gt; - but what will that achieve?\n\nIf all social media platforms were to be switched off tomorrow - who would lose out, really?\n\nThe majority of people on social media are decent and law abiding, merely keeping in touch with their friends, family and followers. Why do they have to be denied this because a few people can\u0026#39;t behave themselves? Why is it always the good people who lose out while the dickheads of the world carry on regardless - moving on to the next thing which they will ultimately ruin for everyone and so the process starts again?!\n\nWhere does it stop?\n\nBan cars because too many people are speeding?\n\nBan phones because too many people use them while driving?\n\nMost people can behave themselves in most areas of life, so why should we all be penalised because of the minority of society that can\u0026#39;t?",
    "Id": "76",
    "Permalink": "http://davecarson.me/2019/03/24/the-problem-with-social-media-is/",
    "Created": "2019-03-24T17:59:41.0000000+00:00",
    "Author": "Dave Carson",
    "Title": "The problem with Social Media is...",
    "Categories": [
      "General",
      "Life",
      "Technology"
    ]
  },
  {
    "Content": "\u0026lt;img class=\u0026quot;  wp-image-83 alignleft\u0026quot; src=\u0026quot;https://davecarsonme.files.wordpress.com/2019/04/imposter.jpg\u0026quot; alt=\u0026quot;imposter\u0026quot; width=\u0026quot;133\u0026quot; height=\u0026quot;167\u0026quot; /\u0026gt;\u0026lt;a href=\u0026quot;https://www.itv.com/news/westcountry/2019-03-20/generation-anxious-the-rise-of-imposter-syndrome-amongst-young-people/\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener\u0026quot;\u0026gt;Apparently a third of Generation Z, those aged between 9 and 21, say that they are anxious and have Imposter Syndrome\u0026lt;/a\u0026gt; - which means they believe that they have somehow cheated their way into a job and they they are worried about being found out and sacked.\n\nNow - before I offer my opinion I would ask you you read the above paragraph again.\n\nI think that we can discount those aged from 9 to 16 here - a paper round isn\u0026#39;t really a career move here - so that leaves us with 16 to 21 year olds and apparently, despite only having worked up to 5 years in any given job they are labelling themselves as Imposters.\n\nWhat a load of old tosh!\n\nWhy the hell do these kids think that they need to know it all straight out of the gate - why the need for instant and total gratification all the damn time?\n\nIn the article linked above there is a young woman starting out as a software developer, a career path I\u0026#39;m already 20 years into, and she says \u0026quot;When I got my first and second jobs, I kind of thought that somehow, I had cheated my way into them\u0026quot;. While that\u0026#39;s not a particularly nice feeling, why on earth should they think that, as a graduate, she would need to know so much.\n\nIn these jobs she will probably have been surrounded by developers with more experience and maybe that set her thought process going. But I have news for you Ms Amini, those around you most certainly don\u0026#39;t know it all. In fact, regardless of their age, they will probably be having thoughts about having Imposter Syndrome themselves.\n\nIf you find yourself feeling the same I urge you to watch this \u0026lt;a href=\u0026quot;https://www.youtube.com/watch?v=hER0Qp6QJNU\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener\u0026quot;\u0026gt;Simon Sinek video\u0026lt;/a\u0026gt; - specifically on \u0026lt;span style=\u0026quot;text-decoration:underline;\u0026quot;\u0026gt;\u0026lt;strong\u0026gt;Millennials in the Workplace\u0026lt;/strong\u0026gt;\u0026lt;/span\u0026gt;.\n\nYou see, I\u0026#39;m not saying that Imposter Syndrome isn\u0026#39;t a real thing - far from it.\n\nThere are well respected people in the Software Development arena, \u0026lt;a href=\u0026quot;https://www.hanselman.com/blog/ImAPhonyAreYou.aspx\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener\u0026quot;\u0026gt;Scott Hanselmen\u0026lt;/a\u0026gt; and \u0026lt;a href=\u0026quot;https://www.goodreads.com/book/show/31572054-the-imposter-s-handbook\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener\u0026quot;\u0026gt;Rob Conery\u0026lt;/a\u0026gt; to name but two, people I look up to, thay believe that they are \u0026lt;img class=\u0026quot;  wp-image-84 alignright\u0026quot; src=\u0026quot;https://davecarsonme.files.wordpress.com/2019/04/31572054.jpg\u0026quot; alt=\u0026quot;31572054\u0026quot; width=\u0026quot;213\u0026quot; height=\u0026quot;331\u0026quot; /\u0026gt;imposters too.\n\nThe thing is this - you can either let it drag you down or drive you on.\n\nKids these days seem to be far too quick to decide that they can\u0026#39;t do something and just give up.\n\nTechnology never stands still and if you are in a technology led career then you have a choice. You can keep doing the same thing, year after year or you can move with the times.\n\nDoing the former is not a problem if you\u0026#39;re happy with it - 10 years experience but the last 5 have all been the same year repeated over and over. People make a good living maintaining legacy systems.\n\nDoing the latter is hard work - a constant task of weighing up what to learn and what to let pass you by. Evenings of reading blogs, watching online courses and devising \u0026#39;pet projects\u0026#39; so that you can practice your new skills. But this will not make you an expert. Getting a job based on these limited skills doesn\u0026#39;t make you an imposter - not in my opinion and Richard Branson agrees with me\n\n\u0026lt;img class=\u0026quot;alignnone size-full wp-image-82\u0026quot; src=\u0026quot;https://davecarsonme.files.wordpress.com/2019/04/richard-branson-quote-opportunity.jpg\u0026quot; alt=\u0026quot;richard-branson-quote-opportunity\u0026quot; width=\u0026quot;1200\u0026quot; height=\u0026quot;630\u0026quot; /\u0026gt;\n\nIf the likes of Richard Branson advocates this approach - then I\u0026#39;m going to give myself a pass on whether I have Imposter Syndrome or not.",
    "Id": "81",
    "Permalink": "http://davecarson.me/2019/04/06/generation-z-and-the-imposter-syndrome/",
    "Created": "2019-04-06T19:10:16.0000000+00:00",
    "Author": "Dave Carson",
    "Title": "Generation Z and the Imposter Syndrome",
    "Categories": [
      "Career",
      "Life",
      "Technology"
    ]
  },
  {
    "Content": "Well things are really starting to get out of hand now - \u0026lt;a href=\u0026quot;https://www.theverge.com/2019/4/18/18485089/facebook-email-password-contacts-upload-1-5-million-security-cybersecurity\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener\u0026quot;\u0026gt;Facebook has admitted asking for personal email credentials and then downloading users contacts without permission\u0026lt;/a\u0026gt;. But it\u0026#39;s OK because it was \u0026#39;unintentional\u0026#39;! Not withstanding the fact that they must have actually written the code to do this - who the hell thought it was an acceptable idea to request a users personal email credentials in the first place? Will they want my debit card PIN next - what about my damn DNA?\n\nHow much longer will the masses put up with this crap? Are they all still so absorbed with getting the \u0026#39;Likes\u0026#39; that they are willing to give up everything - from privacy to self-respect? Unfortunately, it would appear so!\n\nWell, I pulled the final Facebook plug and removed my business Page and the profile that it relied on to exist in the first place. I don\u0026#39;t suppose that Facebook will notice I\u0026#39;ve gone completely now (or frankly that they would care) - but it make me feel a bit better.\n\nI\u0026#39;ve also gone a little further, although nothing significant in the big scheme of things, and ditched Chrome in favour of Firefox with DuckDuckGo replacing Google as the default search engine.\n\nWhat has Google done to upset me? Well, nothing new really - same as always, I\u0026#39;m no longer happy whoring myself for \u0026quot;free\u0026quot; services in return for information that frankly I don\u0026#39;t want to give away anymore.\n\nGoogle used to be a search engine - and that was that. Nothing really sinister there - a search engine doing things differently and making Internet Search significantly better.\n\nBut now Google is much more than that and has gotten far too big to control - a bit like Agent Smith in The Matrix. Uncontrollable, everywhere you look and everywhere you go.\n\nI\u0026#39;m already \u0026lt;a href=\u0026quot;https://davecarson.me/2019/02/18/goodbye-gmail-step-1-anyway/\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener\u0026quot;\u0026gt;in the process of moving away from GMail\u0026lt;/a\u0026gt; and while that may take a little while I\u0026#39;m happy with the progress I\u0026#39;ve made.\n\nI\u0026#39;ve ditched the GMail app in favor of \u0026lt;a href=\u0026quot;https://sparkmailapp.com/blog/spark-mail-arrives-on-android\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener\u0026quot;\u0026gt;Spark\u0026lt;/a\u0026gt; which seems to be working well for me and I\u0026#39;m also working out how to integrate the Calendar app on my phone with my new Fastmail account. There are a few apps that perform the synchronisation between the two but the jury is out regarding whether I can commit to any of them. It\u0026#39;s a similar story for my Contacts - Google Contacts just works but it\u0026#39;s a little harder if you\u0026#39;re not a slave to the machine. Harder - but not impossible!\n\nToday I also considered moving to a different Android distribution - one not provided by Google. I have run these before and had mixed results - the main problem being the access to the apps I need/want. Without access to the Google Play Store I would be pretty limited in my choice of applications - but there is choice!\n\nI have a \u0026#39;spare\u0026#39; Samsung Galaxy S7 and am considering configuring it to be a Google free zone. It won\u0026#39;t be my daily device - not initially anyway - but a vehicle to deteremine whether it is actually possible. Maybe then I can also be free of \u0026lt;a href=\u0026quot;https://www.howtogeek.com/195647/googles-location-history-is-still-recording-your-every-move/\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener\u0026quot;\u0026gt;Google tracking my location - even though I thought I\u0026#39;d turned that off\u0026lt;/a\u0026gt;!\n\nWatch this space :-)",
    "Id": "88",
    "Permalink": "http://davecarson.me/2019/05/01/falling-a-little-further-off-the-grid/",
    "Created": "2019-05-01T20:28:03.0000000+00:00",
    "Author": "Dave Carson",
    "Title": "Falling a little further off the Grid",
    "Categories": [
      "Privacy",
      "Technology"
    ]
  },
  {
    "Content": "\u0026lt;img class=\u0026quot;  wp-image-93 alignleft\u0026quot; src=\u0026quot;https://davecarsonme.files.wordpress.com/2019/06/61-fzzblpsl._sx569_.jpg\u0026quot; alt=\u0026quot;61-FZzBlpsL._SX569_\u0026quot; width=\u0026quot;267\u0026quot; height=\u0026quot;267\u0026quot; /\u0026gt;So, in a previous post I mentioned trying to get my old Samsung Galaxy S7 running different flavour of Android - one that doesn\u0026#39;t rely on Google as much and one that doesn\u0026#39;t come with bloatware, including Facebook (I\u0026#39;m looking at you Samsung).\n\nWell, as it turned out this wasn\u0026#39;t as easy as it used to be - I ran CyanogenMod on a HTC Hero some years ago and it was pretty straightforward to install etc. Maybe it\u0026#39;s the way Android is going, but it\u0026#39;s certainly not that easy now.\n\nSo what alternative did I have? Well, enter the \u0026lt;a href=\u0026quot;https://www.oneplus.com/uk\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener\u0026quot;\u0026gt;OnePlus\u0026lt;/a\u0026gt; range of handsets - the \u0026lt;a href=\u0026quot;https://www.oneplus.com/uk/6t\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener\u0026quot;\u0026gt;6T model\u0026lt;/a\u0026gt; in particular.\n\nThese handsets run a modified version of Android called \u0026lt;a href=\u0026quot;https://www.oneplus.com/uk/oxygenos\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener\u0026quot;\u0026gt;OxygenOS\u0026lt;/a\u0026gt; which runs on some quite impressive hardware - certainly an upgrade from my Pixel 2XL.\n\nI\u0026#39;ve bought a Sim free version this phone, on offer from Amazon for \u0026#39;only\u0026#39; \u0026#194;\u0026#163;470. For now I\u0026#39;m using my existing EE Sim but this may well change in August when my contract is due.\n\nAnyway - the whole point of this was to reduce the level of data that I was sharing with Google, so what have I done there?\n\nPreviously I\u0026#39;ve always loved the fact that when I bought a new phone all I had to do was sign in and my contacts, calendar and photos would just appear - as if by magic.\n\u0026lt;h2\u0026gt;Contacts and Appointments\u0026lt;/h2\u0026gt;\nBut now that I\u0026#39;ve moved my personal and business email accounts to Fastmail all of my contacts and calendar events are stored there as well - but Android doesn\u0026#39;t know anything about them so I\u0026#39;ve had to use my defunct Gmail account to store them.\n\nAfter a bit of research I found a couple of apps, \u0026lt;a href=\u0026quot;https://play.google.com/store/apps/details?id=org.dmfs.carddav.Sync\u0026amp;amp;hl=en_GB\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener\u0026quot;\u0026gt;CardDAV\u0026lt;/a\u0026gt; and \u0026lt;a href=\u0026quot;https://play.google.com/store/apps/details?id=org.dmfs.caldav.lib\u0026amp;amp;hl=en_GB\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener\u0026quot;\u0026gt;CalDAV\u0026lt;/a\u0026gt;, which would act as a bridge between compatible email providers, such as Fastmail, and Android. There are free versions but I paid less than \u0026#194;\u0026#163;1.00 each so they didn\u0026#39;t break the bank.\n\nSo with my new handset out of the box I created a new, clean Google account - I maybe wrong but my understanding is that I still need one especially if I want to use the Google Play Store.\n\nOnce logged into the handset I promptly turned off all of the syncing and the like and installed my email apps (Fastmail for business and \u0026lt;a href=\u0026quot;https://play.google.com/store/apps/details?id=com.readdle.spark\u0026amp;amp;hl=en\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener\u0026quot;\u0026gt;Spark\u0026lt;/a\u0026gt; for personal) and the Card/CalDAV apps. A quick bit of configuration later (logging in and selecting the required address books to sync) and I soon had all my contacts and appointments on my device. Updates on the phone are sync\u0026#39;d to the Fastmail servers and vice-versa.\n\u0026lt;h2\u0026gt;Photos\u0026lt;/h2\u0026gt;\nPhotos is a different matter altogether - I mean, where can you store all your photos if not on Google?\n\nWell, \u0026lt;a href=\u0026quot;https://owncloud.org/\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener\u0026quot;\u0026gt;OwnCloud\u0026lt;/a\u0026gt; - that\u0026#39;s where.\n\nThink of OwnCloud as an alternative to Dropbox. I use to to backup files on my laptops and workstations as well as to transfer files between them all.\n\nBut surely that\u0026#39;s just storing the data with another service..!? Well, not quite.\n\nWhile I have hosted a previous instance of OwnCloud on a RaspberryPi in my home office I am now utilising a virtual private server (VPS) - actually a \u0026lt;a href=\u0026quot;https://www.digitalocean.com/\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener\u0026quot;\u0026gt;Digital Ocean\u0026lt;/a\u0026gt; \u0026quot;Droplet\u0026quot; - for my current instance.\n\nAfter installing the OwnCloud app I am now not only able to access the sync\u0026#39;d data from my other systems, but also configure it to sync photos as I take them - storing a copy off my device in case the worst happens.\n\nOk, I won\u0026#39;t get the \u0026#39;2 years ago today\u0026#39; notifications from Google anymore - but you know what? As interesting as it was to look back, I don\u0026#39;t think I\u0026#39;ll miss them.\n\u0026lt;h2\u0026gt;Now What?\u0026lt;/h2\u0026gt;\nWell it\u0026#39;s early days at the moment but I\u0026#39;m optimistic about what I\u0026#39;ve created here.\n\nTrue, I still have a Google account in the mix and I may well want to utilise some location based services - Maps, \u0026quot;Near Me\u0026quot; \u0026amp;amp; Navigation for instance, so I\u0026#39;m not going to get in a spin about this.\n\nHopefully I will stop getting the \u0026#39;Location Timeline\u0026#39; emails informing me of the \u0026#39;Cities\u0026#39;, \u0026#39;Restaurants\u0026#39; and other points of interest that I\u0026#39;ve visited in the previous month - my \u0026#39;clean\u0026#39; Google account may get a bit polluted but I never intend on checking that inbox anyway.",
    "Id": "92",
    "Permalink": "http://davecarson.me/2019/06/05/new-phone-goodbye-google/",
    "Created": "2019-06-05T19:43:46.0000000+00:00",
    "Author": "Dave Carson",
    "Title": "New phone, goodbye Google?",
    "Categories": [
      "Email",
      "Email Migration",
      "Fastmail",
      "Google",
      "Privacy",
      "Technology"
    ]
  },
  {
    "Content": "\u0026lt;img class=\u0026quot;  wp-image-105 alignleft\u0026quot; src=\u0026quot;https://davecarsonme.files.wordpress.com/2019/07/recycling-symbol-icon-outline-solid-light-green.png\u0026quot; alt=\u0026quot;recycling-symbol-icon-outline-solid-light-green\u0026quot; width=\u0026quot;215\u0026quot; height=\u0026quot;210\u0026quot; /\u0026gt;Before you race down to the comments to berate me about being an eco-terrorist let me make my case.\n\nFirstly, I do recycle. I separate waste into the appropriate bins and dutifully drag them out to the pavement each week. I wash the food trays, rinse the milk cartons and remove the tops from plastic bottles.\n\nBut why am I bothering?\n\nLet\u0026#39;s be honest here, any change that my contribution will make will come after I\u0026#39;m dead and gone - and it doesn\u0026#39;t look like the youth that will be come behind me really give a shit!\n\nI live on the South Coast of the UK and have a lovely beach on my doorstep. Driving along the seafront I frequently see discarded fast-food containers which (I have witnessed) have been left behind by young drivers who can\u0026#39;t be arsed to get out of their cars and walk the 20 feet to a bin and dispose of them properly.\n\nTry to take them to task about this and you normally get a barrage of abuse - so I don\u0026#39;t really bother anymore.\n\nBut it\u0026#39;s not just these disrespectful guys (and girls!) that don\u0026#39;t appear to care though - my own step-children really don\u0026#39;t seem to get it.\n\nAll too often I will go out to my general waste bin and find that one of the kids has essentially emptied the contents of their car into it the last time they visited. Yes, they have their own bins but they don\u0026#39;t park near them so when they pull on the drive they take their chance.\n\nI don\u0026#39;t really care about the fact that this hasn\u0026#39;t been bagged up but all too often there are bottles, cardboard and other recyclable waste in there. They could have put these items in our recycling containers but that would require walking through the house with their rubbish - so they don\u0026#39;t bother.\n\nDon\u0026#39;t get me started on leaving the lights on - even in their own homes where you would think they would think twice as they pay the bills.\n\nSo why should I bother - if even normally sensible kids like this won\u0026#39;t and other local youngsters don\u0026#39;t care?",
    "Id": "99",
    "Permalink": "http://davecarson.me/2019/07/30/recycle-why-bother/",
    "Created": "2019-07-30T20:39:00.0000000+00:00",
    "Author": "Dave Carson",
    "Title": "Recycle - why bother?",
    "Categories": [
      "General",
      "Life"
    ]
  },
  {
    "Content": "We\u0026#39;ve all seen the adverts on the TV, \u0026quot;If you\u0026#39;ve had an accident and it wasn\u0026#39;t your fault then sue them for all you can!\u0026quot;.\n\nSomething that started in America and somehow spread across the Atlantic has turned into a scurge that is plaguing our nation.\n\u0026lt;h2\u0026gt;The Incident at the Cafe\u0026lt;/h2\u0026gt;\nhttps://www.youtube.com/watch?v=8K3BDO82hVI\n\nConsider the above advert, which states that if you \u0026quot;have an accident anywhere it\u0026#39;s your right to claim\u0026quot; and that \u0026quot;you could be entitled to thousands of pounds compensation\u0026quot;, who exactly is going to be sued here?\n\nThe advert goes like this:\n\u0026lt;ol\u0026gt;\n\t\u0026lt;li\u0026gt;A man on his phone approaches a pedestrian crossing and with little hesitation he crosses the road.\u0026lt;/li\u0026gt;\n\t\u0026lt;li\u0026gt;This causes the driver of the silver Suzuki to brake suddenly.\u0026lt;/li\u0026gt;\n\t\u0026lt;li\u0026gt;The driver of the Mini behind cannot stop in time and runs into the back of the now stationary Suzuki causing it to veer towards the pavement.\u0026lt;/li\u0026gt;\n\t\u0026lt;li\u0026gt;A cyclist now mounts the pavement to avoid the Suzuki and startled a waitress who is serving customers outside a cafe - causing her to drop her tray and it\u0026#39;s contents.\u0026lt;/li\u0026gt;\n\t\u0026lt;li\u0026gt;Another customer walking out of the cafe slips on the tray and falls to the ground while the waitress rushes to his aid.\u0026lt;/li\u0026gt;\n\u0026lt;/ol\u0026gt;\nI know this is a contrived scenario but it\u0026#39;s the one that this particular company put out there to tempt clients in.\n\nSo who is the \u0026lt;strong\u0026gt;victim\u0026lt;/strong\u0026gt; here, who is \u0026lt;strong\u0026gt;at fault\u0026lt;/strong\u0026gt; and more importantly, who is going to have to \u0026lt;strong\u0026gt;pay out\u0026lt;/strong\u0026gt;?\n\nThe guy who crossed the road with only a superficial glance to check what was coming? No, he\u0026#39;s long gone and probably still on his phone telling his girlfriend that he was nearly knocked over by some muppet at a pedestrian crossing where he \u0026#39;had right of way\u0026#39;.\n\nThe car drivers appear to be uninjured enough to be able to get straight out of their vehicles. As I understand it the driver of the Mini would be at fault here - he ran into the back of a stationary vehicle afterall but then the Suzuki driver should have had his eye on the pedestrian approaching the crossing. But that\u0026#39;s what motor insurance is for - no need for a \u0026quot;No Win, No Fee\u0026quot; company\u0026#194;\u0026#160; here.\n\nThe cyclist, who looked to be about to undertake the Suzuki on the approach to a pedestrian crossing anyway, appears to pedal back onto the road and continue on her way as if nothing had happened.\n\nThe waitress may have been startled but not injured.\n\nThe only person who appears to be \u0026quot;injured\u0026quot; here is the guy who fell while walking out of the cafe. We don\u0026#39;t know he\u0026#39;s injured though - we don\u0026#39;t see that, he could have broken something or be absolutely fine.\n\n\u0026lt;strong\u0026gt;So who pays?\u0026lt;/strong\u0026gt;\n\nI expect the guy on the floor would be encouraged to claim against the cafe owner - afterall, it was his/her tray the guy slipped on. Nevermind the fact that he wasn\u0026#39;t actually watching where he was going as he left the cafe - watch that bit again. He was looking back into the cafe talking and waving at someone inside.\n\nSo is he really a victim of someone else\u0026#39;s incompetence or just the pillock who wasn\u0026#39;t looking where he was walking?\n\nWhy should anyone have to pay him for not looking where he was going?\n\u0026lt;h2\u0026gt;Accidents in the Workplace\u0026lt;/h2\u0026gt;\nThe National Accident Helpline run adverts which state \u0026quot;If you\u0026#39;ve had an accident and it feels wrong call The National Accident Helpline\u0026quot; and play telephone conversations from victims (probably actors reading what a victims apparently said) who have suffered some accident or other.\n\nhttps://www.youtube.com/watch?v=BUKV7hfzYXE\n\nOne such conversation, apparently with a guy called \u0026#39;Kevin\u0026#39;, goes like this:\n\u0026lt;blockquote\u0026gt;Victim: I work out on the roads, mainly at night. We weren\u0026#39;t supplied with any lighting and it\u0026#39;s pitch dark. I turned by ankle over on a kerb and I\u0026#39;ve got a fracture. Nobody showed any interest and I just carried on working on it most of the night.\u0026lt;img class=\u0026quot;  wp-image-111 alignright\u0026quot; src=\u0026quot;https://davecarsonme.files.wordpress.com/2019/08/hse-posterjpeg.jpeg\u0026quot; alt=\u0026quot;hse-posterjpeg\u0026quot; width=\u0026quot;251\u0026quot; height=\u0026quot;355\u0026quot; /\u0026gt;\u0026lt;/blockquote\u0026gt;\n\u0026lt;blockquote\u0026gt;Operator: Oh my goodness me. Let\u0026#39;s see if I can get you some advice about this. It does sound like something that a solicitor would look into for you.\u0026lt;/blockquote\u0026gt;\nReally?! Well, I\u0026#39;ve got some advice for you \u0026#39;Kevin\u0026#39; - next time you are in a situation where it feels unsafe to work, don\u0026#39;t! You are as responsible for your Health and Safety at work as your employer - maybe more so.\n\nThis is a poster which currently hangs on the wall at my current place of work and it states everything I need to know about ensuring my own Health and Safety while in the workplace.\n\nFor employers, it is a legal requirement to display such a poster or to provide the information to their employees. There will be one on the site you were working on or at the main depot - but you probably never bothered to read it.\n\nIt tells you what your employer must do for you and what you must do in return.\n\nThere is a section on that poster that says \u0026quot;If there is a problem\u0026quot; which states:\n\u0026lt;blockquote\u0026gt;If you are worried about health and safety in your workplace, talk to a supervisor, or health and safety representative.\u0026lt;/blockquote\u0026gt;\nIt goes on to say:\u0026lt;img class=\u0026quot;  wp-image-112 alignright\u0026quot; src=\u0026quot;https://davecarsonme.files.wordpress.com/2019/08/hse-posterjpeg-2.jpg\u0026quot; alt=\u0026quot;hse-posterjpeg-2\u0026quot; width=\u0026quot;172\u0026quot; height=\u0026quot;355\u0026quot; /\u0026gt;\n\u0026lt;blockquote\u0026gt;If, after talking with your employer, you are still worried, phone our Infoline\u0026lt;/blockquote\u0026gt;\n(it helpfully provides the number as well).\n\nSo, you work mainly at night without any lighting? Then YOU should have pushed back and said,\n\u0026lt;blockquote\u0026gt;\u0026quot;this isn\u0026#39;t safe, we need proper lighting to work like this\u0026quot;.\u0026lt;/blockquote\u0026gt;\nI expect your workmates would have been happy that someone said something - because they were all thinking it but like you were too scared to say anything.\n\nIf lighting isn\u0026#39;t provide then you don\u0026#39;t work. If you are forced to work under those conditions then you call the number on the poster. There are very powerful laws in place for this kind of thing - more powerful than any of these \u0026#39;Helplines\u0026#39;.\n\nI know what you\u0026#39;re thinking;\n\u0026lt;blockquote\u0026gt;\u0026quot;It\u0026#39;s not as easy as that mate, if I make a fuss then I\u0026#39;ll be out of a job and I need to work\u0026quot;.\u0026lt;/blockquote\u0026gt;\nThat may well be your perception and may well be the case (but there are laws to protect you there too) - but how did saying nothing work out for you? Not so good by all accounts.\n\nYou had the opportunity to make things better not only for yourself but for every worker on that site - but you decided not to do so. When that decision didn\u0026#39;t pan out well you opted to try to sue someone for your inaction because you somehow feel wronged. Meanwhile your workmates are, apparently, still working in unsafe conditions. Well done!\n\nNext time you are in a similar situation - grow a pair and stand up for yourself. Contact the HSE if you feel that there is a problem and don\u0026#39;t wait until something bad happens. If the employer is not meeting their obligations and putting you at risk then speak up BEFORE something happens.\n\u0026lt;h2\u0026gt;The Impact\u0026lt;/h2\u0026gt;\nThe impact of this industry must be massive, with the public being encouraged to claim for just about anything they can.\n\nWhile there are situations where someone\u0026#39;s gross negligence has been the direct cause of an injury to someone else that\u0026#39;s not the message that these companies are putting out.\n\nPeople are suing other people for making them feel bad and for trivial accidents which, by definition, occur unexpectedly and/or unintentionally.\n\nOthers are \u0026#39;tripping\u0026#39; on uneven pavements while others are slipping on wet floors in supermarkets - all to win a quick cash payout.\n\nIt\u0026#39;s disgusting and immoral and we should be ashamed as a nation that we not only allow it to happen - but to actively encourage it.",
    "Id": "107",
    "Permalink": "http://davecarson.me/2019/08/18/the-british-compensation-scurge/",
    "Created": "2019-08-18T07:44:34.0000000+00:00",
    "Author": "Dave Carson",
    "Title": "The British Compensation Scurge",
    "Categories": [
      "General",
      "Life"
    ]
  },
  {
    "Content": "\u0026lt;img class=\u0026quot;alignnone size-full wp-image-120\u0026quot; src=\u0026quot;https://davecarsonme.files.wordpress.com/2019/11/lmgtfy.png\u0026quot; alt=\u0026quot;lmgtfy\u0026quot; width=\u0026quot;2474\u0026quot; height=\u0026quot;851\u0026quot; /\u0026gt;Why do people feel the need to interupt you to ask a question that they could easily look up themselves on Google (or your search engine of choice - I use Duck Duck Go!)?\n\nThis is especially irritating when the person asking the question is normally staring at their smartphone and could just answer their own question there and then.\n\u0026lt;blockquote\u0026gt;\u0026quot;What time does \u0026amp;lt;some shop\u0026amp;gt; close?\u0026quot;\n\n\u0026quot;What time does the 57 bus stop down the road?\u0026quot;\u0026lt;/blockquote\u0026gt;\nI mean - how the bloody hell should I know? Look it up.!!!\n\nI don\u0026#39;y mind helping people who are prepared to help themselves and put some effort in before just asking for help. It\u0026#39;s not like they don\u0026#39;t know how to use the internet after all.\n\nSome time ago my stepson was supposed to be chasing up a potential job opportunity - but never seemed to get around to it.\n\nWhen asked, \u0026quot;Why have you not called them?\u0026quot; he responded, \u0026quot;I don\u0026#39;t have their phone number\u0026quot;.\n\nReally? Really? Look it the f*ck up!\n\nAs a teenager he had no problem finding all manner of pornography and upgrades for his MS Flight Simulator installation, but look up a phone number? Can you do that on the Internet?\n\nIt\u0026#39;s more ittitating when I get a text message asking me something that could so easily have been looked on on the device that was clearly in their bloody hands!\n\nWell, no more!\n\nWhile it will take some effort on my part I\u0026#39;ll be using the \u0026#39;\u0026lt;a href=\u0026quot;https://lmgtfy.com/\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener\u0026quot;\u0026gt;Let Me Google That For You\u0026lt;/a\u0026gt;\u0026#39; site to show them just how easy it is!\n\nI remember when this was a new site but completely forget about it. It has certainly come a long way.\n\nGo to the site and select from one of the supported search engines.\n\nNext, enter your search term and see what you get back - chances are that you won\u0026#39;t need to search too hard for what is being asked for.\n\n\u0026lt;img class=\u0026quot;  wp-image-121 alignleft\u0026quot; src=\u0026quot;https://davecarsonme.files.wordpress.com/2019/11/lmgtfy-app.png\u0026quot; alt=\u0026quot;lmgtfy-app\u0026quot; width=\u0026quot;252\u0026quot; height=\u0026quot;468\u0026quot; /\u0026gt;\n\nWhen you\u0026#39;re happy with the results click \u0026#39;Get Link\u0026#39; and the link will be copied to your clipboard.\n\nPaste that into a text message and send it.\n\nWhen they click the link (and regardless of how many time you\u0026#39;ve told them not to click on random links, they probably will anyway) their browser will show them a Google-like page (assuming you picked Google) and some animated instructions will show them what they need to do:\n\nIt may take a few attempts but hopefully they will soon get the message.\n\nThere\u0026#39;s even \u0026lt;a href=\u0026quot;https://play.google.com/store/apps/details?id=com.wilderpereira.lmgtfygen\u0026amp;amp;hl=en\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener\u0026quot;\u0026gt;a mobile app available on the Play Store\u0026lt;/a\u0026gt; which currently has a rating of 4.7 so may well be worth a look.",
    "Id": "116",
    "Permalink": "http://davecarson.me/2019/11/14/let-me-google-that-for-you-seeing-you-cant-be-bothered/",
    "Created": "2019-11-14T13:00:28.0000000+00:00",
    "Author": "Dave Carson",
    "Title": "Let me Google that for you - seeing you can\u0026#39;t be bothered!",
    "Categories": [
      "General",
      "Life",
      "Technology"
    ]
  },
  {
    "Content": "\u0026lt;a href=\u0026quot;https://davecarsonme.files.wordpress.com/2020/04/misogyny-definition.png\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener\u0026quot;\u0026gt;\u0026lt;img class=\u0026quot;alignleft wp-image-140 size-medium\u0026quot; src=\u0026quot;https://davecarsonme.files.wordpress.com/2020/04/misogyny-definition.png?w=300\u0026quot; alt=\u0026quot;\u0026quot; width=\u0026quot;300\u0026quot; height=\u0026quot;152\u0026quot; /\u0026gt;\u0026lt;/a\u0026gt;So, I while on lockdown in the UK I, like many others, am spending more some on Twitter. Sure, like most social networks, it\u0026#39;s a bit of a haven for fake news, misinformation and of course the haters and trolls, it\u0026#39;s not as toxic as Facebook.\n\n\u0026lt;img class=\u0026quot;size-full wp-image-135 alignright\u0026quot; src=\u0026quot;https://davecarsonme.files.wordpress.com/2020/04/coronavirus-test.png\u0026quot; alt=\u0026quot;\u0026quot; width=\u0026quot;300\u0026quot; height=\u0026quot;221\u0026quot; /\u0026gt;\n\nWhen I saw a post being retweeted with the following image showing how deep the swab is taken when testing for the coronavirus expressing how unpleasant it looked I decided to respond in kind; I retweeted it with my own thoughts - and that\u0026#39;s were the trouble started.\n\nThe woman who retweeted took exception to me retweeting it, essentially claiming that I was \u0026#39;policing comments made by women\u0026#39; on Twitter. Apparently this is a \u0026#39;Twitter technique used by misogynists\u0026#39;.\n\nI was dumbfounded - who the hell was this person (who happened to be a woman) to label me like that because of an innocuous retweet. I could rant on about this but that will probably end up with me being labelled as something else I\u0026#39;m not but this in itself highlights a problem.\n\n\u0026lt;a href=\u0026quot;https://davecarsonme.files.wordpress.com/2020/04/misogynist-tweet.png\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noopener\u0026quot;\u0026gt;\u0026lt;img class=\u0026quot;alignleft wp-image-142 size-medium\u0026quot; src=\u0026quot;https://davecarsonme.files.wordpress.com/2020/04/misogynist-tweet.png?w=196\u0026quot; alt=\u0026quot;\u0026quot; width=\u0026quot;196\u0026quot; height=\u0026quot;300\u0026quot; /\u0026gt;\u0026lt;/a\u0026gt;Why it is OK for this person (I\u0026#39;m doing it again) to put a label on me without knowing a thing about me, apart from my opinion on whether I would prefer to take the test regardless of the discomfort, but I feel like I cannot respond without treading on eggshells in case I bring the world of Twitter to my door.\n\nLooking at my antagonists other tweets she doesn\u0026#39;t seem to be so held back on passing comments on her retweets, be the original tweeter male or female - she quite opinionated in fact. So why the need to try to suppress my comments using the \u0026#39;anti-woman\u0026#39; angle as a defense against any comeback?\n\nWhy are people (men and women) so easy to offend these days? It\u0026#39;s not like I made any reference to anyone except myself in my response - so with the need to attack me for having a differing opinion? Are men not allowed to have one anymore, especially when it\u0026#39;s deemed to be at the expense of a womans?\n\nThere are a lot of tweets saying that when we come through this, which we will, then we will all be more appreciative and more tolerant of those around us. At the moment, that doesn\u0026#39;t seem to be a universal belief.",
    "Id": "134",
    "Permalink": "http://davecarson.me/2020/04/02/so-men-cant-have-an-opinion-anymore/",
    "Created": "2020-04-02T14:39:48.0000000+00:00",
    "Author": "Dave Carson",
    "Title": "So, men can\u0026#39;t have an opinion anymore?",
    "Categories": [
      "Life",
      "Twitter"
    ]
  },
  {
    "Content": "\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;In my \u0026lt;a href=\u0026quot;https://davecarson.me/2020/04/02/so-men-cant-have-an-opinion-anymore/\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noreferrer noopener\u0026quot;\u0026gt;previous post\u0026lt;/a\u0026gt; I had a mini-rant about a woman on Twitter calling me a Misogynist because I retweeted one of her tweets and she didn\u0026#39;t like it. Neither the tweet or retweet referred to women in any way - but I\u0026#39;m a man so apparently that doesn\u0026#39;t matter.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;In the months since that post I have found it harder and harder to put finger to keyboard and post to social media (which basically means Twitter for me as I don\u0026#39;t use Facebook anymore) in case I get someones back up. \u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;But this is totally contrary to \u0026lt;a rel=\u0026quot;noreferrer noopener\u0026quot; href=\u0026quot;https://davecarson.me/2018/12/14/so-here-were-all-are/\u0026quot; target=\u0026quot;_blank\u0026quot;\u0026gt;why I created this blog in the first place\u0026lt;/a\u0026gt; - not so that I could go around tolling and deliberately offending people, but as somewhere I can express my opinions and feelings.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;But it\u0026#39;s not as easy as that is it? \u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;A lot has happened in the short time since my previous post and it would appear that as not just \u0026#39;a man\u0026#39; but a \u0026#39;privileged white man\u0026#39; I have to be extra careful about what I say.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Even now I\u0026#39;m wondering whether or not to leave that sentence in and that saddens me to the point where I\u0026#39;m wondering whether to just delete this blog and have done with it.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;My mind is split between \u0026#39;Screw it, I\u0026#39;m not a bad person with extreme views looking to stir things up\u0026#39; and \u0026#39;Why bother, if someone decides to take offence and things spiral out of control - it could end really badly for me. Is it worth it?\u0026#39;.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Maybe I should just stick to my tech blog - but even there apparently things are not as clear cut as they seem.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;There was hatred and intolerance in the world before Covid-19 but along with it\u0026#39;s viral payload it seems to have sharpened these to a razor-like edge.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;",
    "Id": "150",
    "Permalink": "http://davecarson.me/2020/08/16/its-not-gotten-any-better-has-it/",
    "Created": "2020-08-16T10:44:58.0000000+00:00",
    "Author": "Dave Carson",
    "Title": "It\u0026#39;s not gotten any better, has it?",
    "Categories": [
      "General",
      "Life"
    ]
  },
  {
    "Content": "\u0026lt;!-- wp:quote --\u0026gt;\n\u0026lt;blockquote class=\u0026quot;wp-block-quote\u0026quot;\u0026gt;\u0026lt;p\u0026gt;TLDR; I still have a job, albeit not the one I had at the start of the year and my health. None of my nearest and dearest have been affected by Covid-19. I\u0026#39;m one of the lucky ones but that doesn\u0026#39;t mean I\u0026#39;ve had it easy.\u0026lt;/p\u0026gt;\u0026lt;p\u0026gt;The key players in the UK Government have shown themeselves to be dithering, inept and arguably corrupt. The power has gone to their heads and I fear they will be reluctant to give it up.\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;\n\u0026lt;!-- /wp:quote --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;At the start of 2020 I was a software development contractor operating through my own UK Limited Company. As we approach Christmas I am still a Software Developer but no longer work for myself, I\u0026#39;m just a regular employee (actually working for a previous client).\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Apart from that, things are pretty much the same for me - yes, I\u0026#39;m one of the lucky ones But it hasn\u0026#39;t been plain sailing by any means.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:heading {\u0026quot;style\u0026quot;:{\u0026quot;typography\u0026quot;:{\u0026quot;lineHeight\u0026quot;:\u0026quot;1\u0026quot;}}} --\u0026gt;\n\u0026lt;h2 style=\u0026quot;line-height:1;\u0026quot;\u0026gt;Covid-19\u0026lt;/h2\u0026gt;\n\u0026lt;!-- /wp:heading --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;I\u0026#39;m lucky in that I live in the South West of England and we have had very low infection rates and, thankfully, few Covid related deaths.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;To date I only know one person, a friend of my wife, who tested positive for Covid-19. She spent a couple of nights in hospital and recovered quickly.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Our latest grandchild was born just before lockdown started and it was hard not seeing her and the rest of the family during that time. \u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;There are a couple of care workers in the family who are now regularly tested, one lives with us, so I\u0026#39;m pretty sure that none of us have had it - asymptomatic or otherwise.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;We observed the lockdown and were, again, lucky to have a garden to enjoy the decent summer weather. We extended the decking, painted the outside of the house and I was able to make a dent in some online training courses that I had backing up.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;By the end of lockdown I was keen to get out and about but it was a very different world. Maybe we\u0026#39;ll never get back to how we were - and maybe that\u0026#39;s for the best.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:heading {\u0026quot;style\u0026quot;:{\u0026quot;typography\u0026quot;:{\u0026quot;lineHeight\u0026quot;:\u0026quot;1\u0026quot;}}} --\u0026gt;\n\u0026lt;h2 style=\u0026quot;line-height:1;\u0026quot;\u0026gt;The Covid response\u0026lt;/h2\u0026gt;\n\u0026lt;!-- /wp:heading --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;My personal opinion of the UK Government during this time isn\u0026#39;t a good one. I saw dithering, indecision, incompetance and what I can only call corruption.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;I watched the news in disbelief as we monitored the infection rates around Europe increasing with headlines like \u0026#39;we are two weeks behind Italy\u0026#39; - but we did nothing to prevent Covid-19 entering the UK. The ports and airports were open and travellers arrived and dispursed into the country largely unchecked.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;When we finally locked down the rules were confusing and the language used was vague at best. There were videos of the Police telling people to they were no allowed in their own front gardens, panic buyers clearing shelves of food and toilet roll.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Add to this that the people telling us how to \u0026#39;stay safe\u0026#39; by washing our hands and maintaining a social distancing ended up becoming infected and MPs being caught breaking the rules that were imposed on the rest of us and it was becoming clear that the \u0026#39;Us and Them\u0026#39; divide was as present as ever - \u0026#39;Do as we say, not as we do\u0026#39;.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;We are now hearing that many contracts for PPE and other Covid-19 related services have been awarded, without competition or a tendering process, to companies with clear links to Government ministers. Millions of pounds of tax payers money handed over, sometimes for products and services that were not fit for purpose. Masks that didn\u0026#39;t meet the required safety specifications and a \u0026#39;world beating\u0026#39; Track and Trace app which didn\u0026#39;t actually work.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:heading {\u0026quot;style\u0026quot;:{\u0026quot;typography\u0026quot;:{\u0026quot;lineHeight\u0026quot;:\u0026quot;1\u0026quot;}}} --\u0026gt;\n\u0026lt;h2 style=\u0026quot;line-height:1;\u0026quot;\u0026gt;Career\u0026lt;/h2\u0026gt;\n\u0026lt;!-- /wp:heading --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;2020 marked my ninth year of contracting. Operating through my own Limited Company I worked for numerous clients across multiple sectors during that time. I provided Software Development services on a day rate basis normally for between 3 and 6 months.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;As the first lockdown approached I was working with a startup company on an Artificial Intelligence project but this was pulled due to the uncertainty. At that point the contract market practically imploded and I was without work between February and August.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;I wasn\u0026#39;t unduly worried at the start of lockdown as I had a list of online training courses I had been queuing out for \u0026#39;when I had time\u0026#39; and the wife had a number of jobs around the house too.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Financially I was quite fortunate in that my company had enough funds to pay me enough to cover my needs - but not my wants - for the duration. I was not eligable for any meaningful support from the Government, so had to fend for myself during this time, depleating the company profits in the process. No furlough for me - as a Limited Company director I became part of what is now known as the \u0026#39;\u0026lt;a rel=\u0026quot;noreferrer noopener\u0026quot; href=\u0026quot;https://twitter.com/hashtag/ExcludedUK\u0026quot; target=\u0026quot;_blank\u0026quot;\u0026gt;ExcludedUK\u0026lt;/a\u0026gt;\u0026#39;.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;During 2019 I had been considering throwing the towel and returning to \u0026#39;regular employment\u0026#39;. This was mainly due to the UK Government targeting contractors via the IR35 tax legislation (which I won\u0026#39;t bore you with here) but it wasn\u0026#39;t the only factor.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Having to look for a new role every 3 - 6 months is quite a frustrating process and although I always seemed to secure something and only had a couple of spells \u0026#39;between contracts\u0026#39; it wasn\u0026#39;t something I looked forward to.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;I was lucky in that I had built up a list of recruiters, my A-List, who actually knew understood my skillset and requirements. They didn\u0026#39;t contact me with irrelevant, unsuitable roles like many of the others who ran a simple \u0026#39;Software Developer\u0026#39; keyword search on their database and emailed all the resulting \u0026#39;candidates\u0026#39;. This meant I\u0026#39;d receive emails for permanent roles using technology I had no experience in located hundreds of miles away from where I lived.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;After making the decision to \u0026#39;pull the pin\u0026#39; and return to regular employment I knew that I would (hopefully) only have to go through the process one more time.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;After a few interviews where either I wasn\u0026#39;t suitable for or interested in the role (or the company) I was contacted by a client I had previously contracted for and asked if I would consider returning as a regular employee.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;I\u0026#39;ve worked for many clients, some were very slick and I wondered how others managed to release software at all. Fortunately the client who contacted me was well towards the slick end of the scale so it was a relatively easy decision to make.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;At the time of writing I\u0026#39;ve really enjoyed the last three months working with them and am about to pass my probation period.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:heading --\u0026gt;\n\u0026lt;h2\u0026gt;Christmas 2020 - Go or No Go\u0026lt;/h2\u0026gt;\n\u0026lt;!-- /wp:heading --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Christmas is approaching and the country is clammering to be allowed to see their families at this festive time. Whether the UK Government will relent or not is uncertain but it\u0026#39;s a double edged sword. Do we risk households meeting and potentially spreading the virus or do we all staying in our bubbles and put Christmas off until April?\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Well, everybodys situation is different and the risk of infection varies dramatically across the country - so why do we think that there is a \u0026#39;one size fits all\u0026#39; solution? Why can\u0026#39;t we apply that common sense that the Government has been banging on about and make the decision that is right for us? \u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;I\u0026#39;ve seen a lot of tweets saying \u0026#39;well if you kill granny then it\u0026#39;s on you\u0026#39; and while I understand that it could well be some grannys last Christmas anyway and, quoting my mother in law, \u0026quot;if I can\u0026#39;t see my family then I may as well be dead\u0026quot;.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;If the previous behaviour of our MPs is anything to go by, if we were to stay in our bubbles for Christmas we would no doubt hear about them breaking the rules - the rules don\u0026#39;t apply to them remember.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;A vaccine is just around the corner (no doubt another debacle of organisation in the making) so maybe we could (or should) wait - but we are only human and we can only be pushed so far. At the start of the first lockdown the newspapers were banging on about the impact on mental health and I just rolled my eyes - but as it stands today, I think I know where they were coming from.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;We need to option to have a near normal Christmas - if some don\u0026#39;t want to \u0026#39;take the risk\u0026#39; to meet their family then they are free to stay in their bubble. The rest can apply a bit of common sense and meet in a safe a manner as possible.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;",
    "Id": "155",
    "Permalink": "http://davecarson.me/2020/11/22/2020-covid-19-and-me/",
    "Created": "2020-11-22T19:39:59.0000000+00:00",
    "Author": "Dave Carson",
    "Title": "2020, Covid-19 and Me",
    "Categories": [
      "Life"
    ]
  },
  {
    "Content": "\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;So, we\u0026#39;re a month into 2021 and i\u0026#39;ve had a subtle mindshift over the past 31 days or so.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Previous posts on this blog, as few of them as there are, have mainly been me venting my spleen about one thing or another under the misguided understanding that it would make me feel better. It didn\u0026#39;t - in fact quite the opposite.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Now that\u0026#39;s not to say that things like the ineptitude of the UK Government in tackling the Covid-19 pandemic, excessive political correctness and continued erosions of our privacy (online and otherwise) don\u0026#39;t wind me up - they do. But getting wound up about it and sitting in front of a keyboard for an hour ranting about it doesn\u0026#39;t really serve anybody - least of all me. So what\u0026#39;s the point?\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;I am reminded of the \u0026#39;Serenity Prayer\u0026#39; (or at least an adaptation of it):\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:image {\u0026quot;id\u0026quot;:164,\u0026quot;width\u0026quot;:775,\u0026quot;height\u0026quot;:278,\u0026quot;sizeSlug\u0026quot;:\u0026quot;large\u0026quot;,\u0026quot;linkDestination\u0026quot;:\u0026quot;none\u0026quot;} --\u0026gt;\n\u0026lt;figure class=\u0026quot;wp-block-image size-large is-resized\u0026quot;\u0026gt;\u0026lt;img src=\u0026quot;https://davecarsonme.files.wordpress.com/2021/02/serenity.png?w=611\u0026quot; alt=\u0026quot;\u0026quot; class=\u0026quot;wp-image-164\u0026quot; width=\u0026quot;775\u0026quot; height=\u0026quot;278\u0026quot; /\u0026gt;\u0026lt;/figure\u0026gt;\n\u0026lt;!-- /wp:image --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;The fact that most of our top level politicians don\u0026#39;t seem to be able to admit fault, to \u0026lt;a rel=\u0026quot;noreferrer noopener\u0026quot; href=\u0026quot;https://www.express.co.uk/showbiz/tv-radio/1383379/GMB-uproar-Matt-Hancock-reaction-free-school-meals-row-ITV-video\u0026quot; target=\u0026quot;_blank\u0026quot;\u0026gt;answer a simple question\u0026lt;/a\u0026gt; and blinker themselves from facts that don\u0026#39;t fit with their strategy or agenda is something I have no control over. The UK currently has a Government that can\u0026#39;t/won\u0026#39;t govern and an Opposition that can\u0026#39;t/won\u0026#39;t oppose. When the next election comes along it will be like making a choice between two tropical diseases. \u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;I\u0026#39;ll put my cross on the box - that\u0026#39;s really all I can do as a UK citizen - but I don\u0026#39;t expect too much to change in the big scheme of things so why should I get stressed out about it?\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;As for political correctness we are in a world where \u0026lt;a rel=\u0026quot;noreferrer noopener\u0026quot; href=\u0026quot;https://www.msn.com/en-xl/news/other/disney-blocks-under-7s-from-racist-peter-pan-dumbo-and-aristocats/ar-BB1d2e6R\u0026quot; target=\u0026quot;_blank\u0026quot;\u0026gt;Disney feel the need to block under 7s from watching Dumbo or Peter Pan\u0026lt;/a\u0026gt; (and others) because of the risk of causing offence. Frankly that\u0026#39;s insane, you could find something to be offended about in everything on TV if you wanted to. Major media outlets folding under some perceived pressure from a vocal minority is pathetic in my opinion - but again, something I cannot change.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;We are already in a world where jokes are frowned upon - they are normally at someone/somethings expense so there is the possibily for causing offence - where you can\u0026#39;t speak your mind without someone accusing you of being a misoginist, a racist or some other deviant and where you can\u0026#39;t challenge your accusers views for the same reason.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;So will I get stressed about that? Well, in the real world maybe. I don\u0026#39;t want to offend friends, family or other people I interact on a daily basis. But on the internet, where people seemingly go out of their way to be offended by something - frankly they can kiss my arse! Their rants are easily ignored and blocked. Why do I care what they think?\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;The big thing for me that I won\u0026#39;t step back from is privacy and efforts by Governments and Tech Firms to erode it - the former for control and the latter for financial gain.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;So my posts on here will now chnage tack somewhat - no more doom and gloom. If that\u0026#39;s not your thing then so be it, there\u0026#39;s plenty of places you can go to ready that sort of thing and I wish you well.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Onwards and upwards!\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;",
    "Id": "163",
    "Permalink": "http://davecarson.me/2021/02/05/2021-one-month-in-a-mindshift/",
    "Created": "2021-02-05T08:26:35.0000000+00:00",
    "Author": "Dave Carson",
    "Title": "2021 - One month in ... a mindshift",
    "Categories": [
      "Life"
    ]
  },
  {
    "Content": "\u0026lt;!-- wp:image {\u0026quot;align\u0026quot;:\u0026quot;left\u0026quot;,\u0026quot;id\u0026quot;:183,\u0026quot;width\u0026quot;:184,\u0026quot;height\u0026quot;:448,\u0026quot;sizeSlug\u0026quot;:\u0026quot;large\u0026quot;,\u0026quot;linkDestination\u0026quot;:\u0026quot;none\u0026quot;} --\u0026gt;\n\u0026lt;div class=\u0026quot;wp-block-image\u0026quot;\u0026gt;\u0026lt;figure class=\u0026quot;alignleft size-large is-resized\u0026quot;\u0026gt;\u0026lt;img src=\u0026quot;https://davecarsonme.files.wordpress.com/2021/03/confused-stickman.png?w=421\u0026quot; alt=\u0026quot;\u0026quot; class=\u0026quot;wp-image-183\u0026quot; width=\u0026quot;184\u0026quot; height=\u0026quot;448\u0026quot; /\u0026gt;\u0026lt;/figure\u0026gt;\u0026lt;/div\u0026gt;\n\u0026lt;!-- /wp:image --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;A good few years ago I deleted my Facebook account. This was before the 2018 Cambridge Analytica Scandal but I felt vindicated that I\u0026#39;d gotten my data outta there .... or had I?\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Recently I had to create a new Facebook account for a project I was involved with - they were using a Facebook group for their communications etc - and while I resisted it was clear that this was the only way forward.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;So, using a temporary email address, my name and date or birth (required for the project I was working on) I signed up for a new account and immediately locked down all the privacy settings I could find and joined the group.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;All was well during my first session as I was only really interacting within the group - but when I logged into Facebook (using a separate Firefox instance in Private Browsing mode) and landed on my Feed I was stunned to see the \u0026#39;People You May Know\u0026#39; section contained family members and friends that used to be connected to. \u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;So, notwithstanding the fact that I had requested my account to be deleted, how the hell did they join the dots using the information I gave them?\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Well, obviously they didn\u0026#39;t actually delete my data and simply pulled it back from their \u0026#39;archive\u0026#39; using my name and cross referenced it with my date of birth.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Fact is, I\u0026#39;m not surprised by this really and it reinforces my distrust of Facebook. They have risen to a level of power that rivals some governments and seem to think they are untouchable. They\u0026#39;ve been caught lying and engaging in dubious practices with little fear of any real consequences - much like the UK government to be honest; ;-)\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;I\u0026#39;m glad I can throw my temporary account away in a few weeks, I can\u0026#39;t really say \u0026#39;delete my account\u0026#39; as it is clear that isn\u0026#39;t a thing, and it puts a totally different slant on WhatsApps recent privacy policy debarkle (taking into account it is a Facebook company and they want to share data with them).\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;",
    "Id": "179",
    "Permalink": "http://davecarson.me/2021/03/03/so-how-did-facebook-know-it-was-me/",
    "Created": "2021-03-03T20:49:38.0000000+00:00",
    "Author": "Dave Carson",
    "Title": "So, how did Facebook know it was me?",
    "Categories": [
      "Privacy"
    ]
  },
  {
    "Content": "\u0026lt;!-- wp:image {\u0026quot;align\u0026quot;:\u0026quot;left\u0026quot;,\u0026quot;id\u0026quot;:187,\u0026quot;sizeSlug\u0026quot;:\u0026quot;medium\u0026quot;,\u0026quot;linkDestination\u0026quot;:\u0026quot;none\u0026quot;} --\u0026gt;\n\u0026lt;div class=\u0026quot;wp-block-image\u0026quot;\u0026gt;\u0026lt;figure class=\u0026quot;alignleft size-medium\u0026quot;\u0026gt;\u0026lt;img src=\u0026quot;https://davecarsonme.files.wordpress.com/2021/03/whatsapp-to-signal.png?w=300\u0026quot; alt=\u0026quot;\u0026quot; class=\u0026quot;wp-image-187\u0026quot; /\u0026gt;\u0026lt;/figure\u0026gt;\u0026lt;/div\u0026gt;\n\u0026lt;!-- /wp:image --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;If you\u0026#39;ve read any of my previous posts you will know that I\u0026#39;m quite keen on my privacy. I don\u0026#39;t use free services for email, VPN or data storage (because, in general, if you don\u0026#39;t pay for a service, you are the product), I don\u0026#39;t use Facebook and I\u0026#39;m careful about what I share on social media sites that I do use such as LinkedIn and Twitter.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;So, why am I using WhatsApp? I mean, it\u0026#39;s part of the Facebook family of products and it\u0026#39;s free to use - so taking the above \u0026quot;you are the product\u0026quot; statement into account and knowing what a toxic cesspit Facebook actually is, why do I use it?\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Well, basically it\u0026#39;s because that\u0026#39;s what the rest of the family use and we have a Group Chat that we all participate in - it\u0026#39;s convenient, simple as that.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;But \u0026lt;a href=\u0026quot;https://www.igeeksblog.com/whatsapp-new-privacy-policy/\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noreferrer noopener\u0026quot;\u0026gt;when WhatsApp announced changes to their privacy policy\u0026lt;/a\u0026gt; it sent shockwaves around the world with millions of users moving to other encrypted messaging platforms such as Signal and Telegram. WhatsApp have admitted that their announcment was somewhat poorly worded and have delayed the introduction of the privacy policy until May - but it\u0026#39;s still coming. But what does that mean to me?\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Well, although I know that my messages will still be encrypted it\u0026#39;s the fact that my other data would be passed onto Facebook doesn\u0026#39;t sit well with me. Seriously, take a look at the data listed in the above link - this isn\u0026#39;t trival stuff! Why does a messaging app need to know what browser I\u0026#39;m using, what cell provider I\u0026#39;m using or how charged my battery is? What possible need can they have for this information?\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;WhatsApp are clearly attempting to looking to make money from the data they are going to collect, probably via targetted advertising, and I fully understand that - but it\u0026#39;s my data and I\u0026#39;ll decide whether I let it be used like this.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;So, after looking at what value I get from WhatsApp I think I\u0026#39;ll be deleting my account in the very near future. That\u0026#39;s not to say that the family group chat has no value but frankly they can still text me if they really want to - it\u0026#39;s not like I\u0026#39;m getting rid of my phone altogether and going to live off grid!\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Obviously I will want to replace it with a suitable alternative and after a bit of investigation I\u0026#39;ve decided to go with \u0026lt;a href=\u0026quot;https://signal.org/\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noreferrer noopener\u0026quot;\u0026gt;Signal\u0026lt;/a\u0026gt;. It will replace the built-in SMS application on my Android phone so that I can receive all my messages into a single app and if the sender is using Signal as well then the message will be encrypted end-to-end. What\u0026#39;s not to like?\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;But Signal is free so you must be the product I hear to say .... well, yes and no.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Yes it\u0026#39;s free to install and to use, although you can make one off or ongoing donations, but they don\u0026#39;t collect any of my information beyond my phone number. The app has access to my contacts and can determine whether any of them are also using Signal so clearly there is some movement of data but Signal are a non profit organisation so they don\u0026#39;t need to rely on advertising to keep the lights on.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;What\u0026#39;s to stop Signal doing the same in the future? Absolutely nothing I suppose! But if that happened, what friction would I feel to move to another platform, \u0026lt;a href=\u0026quot;https://telegram.org/\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noreferrer noopener\u0026quot;\u0026gt;Telegram \u0026lt;/a\u0026gt;for instance? It\u0026#39;s not like I\u0026#39;m storing 1000\u0026#39;s of email message or photos on their servers - they, like WhatsApp, don\u0026#39;t actually store my messages once they\u0026#39;ve been delivered/received.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;On top of that, I have setup regular, albeit small, donations to Signal to support their efforts - which makes me feel warm and fuzzy inside.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;At the end of the day, it\u0026#39;s all about protecting my privacy. I\u0026#39;m not doing anything illegal here, I just don\u0026#39;t see it as anyone elses business where I go (when I\u0026#39;m allowed back out), where I eat (when restuarants are allowed to open) or what I buy.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;",
    "Id": "171",
    "Permalink": "http://davecarson.me/2021/03/08/whats-up-with-whatsapp/",
    "Created": "2021-03-08T08:28:28.0000000+00:00",
    "Author": "Dave Carson",
    "Title": "What\u0026#39;s up with WhatsApp?",
    "Categories": [
      "Privacy",
      "Technology"
    ]
  },
  {
    "Content": "\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;What a difference a month makes. In \u0026lt;a rel=\u0026quot;noreferrer noopener\u0026quot; href=\u0026quot;https://davecarson.me/2021/03/08/whats-up-with-whatsapp/\u0026quot; target=\u0026quot;_blank\u0026quot;\u0026gt;my last post\u0026lt;/a\u0026gt; I explained why I was ditching WhatsApp and moving to Signal - even donating to the latter to help keep the servers running. Well, just over four weeks later and I\u0026#39;ve now ditched Signal (and cancelled my donations obviously).\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;When I started using Signal it was pretty straightforward as I was an Android user and it was able to replace the default SMS application on my phone (something I think has only become possible on iPhones recently) so everything was in one place. The app handled standard SMS message and for the two friends who were already using Signal we were able to send private, encrypted messages.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;But then Signal announced that they were going to \u0026lt;a rel=\u0026quot;noreferrer noopener\u0026quot; href=\u0026quot;https://www.wired.com/story/signal-mobilecoin-payments-messaging-cryptocurrency/\u0026quot; target=\u0026quot;_blank\u0026quot;\u0026gt;include a privacy-focused, cryptocurrency based payment system\u0026lt;/a\u0026gt; and all hell broke loose. Many tech sites reported this and focused on the benefits and the fight against financial surveillance but many users were up in arms about the whole thing.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;In the above link Matt Green, a cryptographer at Johns Hopkins University said:\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:quote --\u0026gt;\n\u0026lt;blockquote class=\u0026quot;wp-block-quote\u0026quot;\u0026gt;\u0026lt;p\u0026gt;Signal as an encrypted messaging product is really valuable. Speaking solely as a person who is really into encrypted messaging, it terrifies me that they\u0026#39;re going to take this really clean story of an encrypted messenger and mix it up with the nightmare of laws and regulations and vulnerability that is cryptocurrency\u0026lt;/p\u0026gt;\u0026lt;cite\u0026gt;Matt Green (John Hopkins University)\u0026lt;/cite\u0026gt;\u0026lt;/blockquote\u0026gt;\n\u0026lt;!-- /wp:quote --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Not having invested much time in Signal and only having a couple of friends actually using it I decided it really wasn\u0026#39;t worth getting embroiled in all this and deleted my account.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;But it was while I was looking at the alternatives (and frankly coming up short) I had a thought;\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:quote --\u0026gt;\n\u0026lt;blockquote class=\u0026quot;wp-block-quote\u0026quot;\u0026gt;\u0026lt;p\u0026gt;\u0026lt;strong\u0026gt;What does privacy actually mean to me, me personally. What am I trying to achieve here and do I really need encrypted messaging?\u0026lt;/strong\u0026gt;\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;\n\u0026lt;!-- /wp:quote --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Now, I\u0026#39;m a law abiding guy, I live in a country where criticise the government without fear of being arrested (or even noticed as it happens), I have no reason to think that I am on any \u0026#39;Watch List\u0026#39; and I\u0026#39;m not working on any projects right now where the need for secrecy is important. \u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Others may well be in a different position and I recognise that for them it is very important that they have access to secure communications through such systems as WhatsApp and Signal. But is it really important for me or are my goals \u0026amp;amp; needs different? Compared to those whose lives depending on absolute privacy, me requirements are fairly trivial but nonetheless important to me.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:pullquote {\u0026quot;className\u0026quot;:\u0026quot;is-style-default\u0026quot;} --\u0026gt;\n\u0026lt;figure class=\u0026quot;wp-block-pullquote is-style-default\u0026quot;\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p\u0026gt;Now, that doesn\u0026#39;t mean I have nothing to hide - I do. We all do whether we like it or not! But this will differ from person to person. One size certainly does not fit all.\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;\u0026lt;/figure\u0026gt;\n\u0026lt;!-- /wp:pullquote --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;So, if someone wants to snoop on my SMS messages then have at it - they will probably be a great cure for insomnia. Maybe this is because I\u0026#39;m already filtering what I send over this inherently insecure channel - or maybe its just because I\u0026#39;m dull - it\u0026#39;s not important.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;But, web browsing, internet banking, email, photos, personal documents etc - well, that\u0026#39;s a totally different matter. These things are important and not because there is anything illegal in there - it\u0026#39;s private, and there is an important difference.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;For me the biggest concerns are:\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:list {\u0026quot;ordered\u0026quot;:true} --\u0026gt;\n\u0026lt;ol\u0026gt;\u0026lt;li\u0026gt;Data Breaches\u0026lt;/li\u0026gt;\u0026lt;li\u0026gt;Targeted Advertising\u0026lt;/li\u0026gt;\u0026lt;/ol\u0026gt;\n\u0026lt;!-- /wp:list --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;When Data Breaches happen our data falls into the hands of criminals who will exploit it for their own personal gain. The data is sold and used to steal peoples identities and bombard them with spam and unwanted calls as well as to target the individuals personal safety.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;In a week where \u0026lt;a rel=\u0026quot;noreferrer noopener\u0026quot; href=\u0026quot;https://www.theguardian.com/technology/2021/apr/11/another-huge-data-breach-another-stony-silence-from-facebook\u0026quot; target=\u0026quot;_blank\u0026quot;\u0026gt;Facebook admits that personal details for over half a billion user accounts have been breached\u0026lt;/a\u0026gt; and \u0026lt;a rel=\u0026quot;noreferrer noopener\u0026quot; href=\u0026quot;https://www.financialexpress.com/industry/technology/after-facebook-linkedin-confirms-data-breach-personal-details-of-500-million-users-leaked/2230131/\u0026quot; target=\u0026quot;_blank\u0026quot;\u0026gt;LinkedIn are apparently on the verge of doing to the same for a similar number\u0026lt;/a\u0026gt; it is clear that despite whatever measures they put in place, there is always a way in.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;For me the big data item here is the phone number. Not only can it be used for direct contact it can also be used to gain access to incoming SMS message - say from your bank when you try to sign in. \u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;I\u0026#39;m lucky in that I ditched Facebook years ago and never gave them my phone number and while I still use LinkedIn they don\u0026#39;t have my phone number either - because I\u0026#39;m careful about letting that level of information out. The same goes for my home address - if a service really doesn\u0026#39;t actually need it (as opposed to just wanting it) then they don\u0026#39;t get it ... simple as that.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;As for Targeted Advertising, well I have made efforts to reduce this over the years by moving away from Google and Facebook services, using Firefox with a handful of privacy plugins and running all my internet activity through a paid for VPN service (one that doesn\u0026#39;t log my activity to sell on!).\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;So over the next few weeks I\u0026#39;ll be taking a look at the data I feel is important for me to protect and the steps I am taking (or need to take) to do so. From email and VPN services to browser extensions and running my own personal cloud.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;I\u0026#39;ll post the interesting bits here, without revealing too much about my setup of course, explaining what worked and what didn\u0026#39;t - for me anyway.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;\u0026lt;strong\u0026gt;We live in a connected world now and not everyone has our best interests at heart. We need to be careful about what we share and who we share it with.\u0026lt;/strong\u0026gt;\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:pullquote --\u0026gt;\n\u0026lt;figure class=\u0026quot;wp-block-pullquote\u0026quot;\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p\u0026gt;Be careful people - it\u0026#39;s a jungle out there!\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;\u0026lt;/figure\u0026gt;\n\u0026lt;!-- /wp:pullquote --\u0026gt;",
    "Id": "191",
    "Permalink": "http://davecarson.me/2021/04/11/so-what-is-privacy-anyway/",
    "Created": "2021-04-11T09:32:36.0000000+00:00",
    "Author": "Dave Carson",
    "Title": "So, what is privacy anyway?",
    "Categories": [
      "General",
      "Life",
      "Privacy",
      "Technology"
    ]
  },
  {
    "Content": "\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Reviewing my privacy infrastructure will start with my current Virtual Private Network (VPN) of choice, \u0026lt;a href=\u0026quot;https://protonvpn.com/\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noreferrer noopener\u0026quot;\u0026gt;ProtonVPN\u0026lt;/a\u0026gt;.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;ProtonVPN is provided by a Swiss based company that also offers the ProtonMail email service (more on this in a later post). Being based in Switzerland means that the service is protected by some of the worlds strongest privacy laws.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;In this post I will answer (or at least try to answer) three questions:\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:list {\u0026quot;ordered\u0026quot;:true} --\u0026gt;\n\u0026lt;ol\u0026gt;\u0026lt;li\u0026gt;Why do I use a VPN\u0026lt;/li\u0026gt;\u0026lt;li\u0026gt;Should you use one \u0026lt;/li\u0026gt;\u0026lt;li\u0026gt;Would I recommend ProtonVPN?\u0026lt;/li\u0026gt;\u0026lt;/ol\u0026gt;\n\u0026lt;!-- /wp:list --\u0026gt;\n\n\u0026lt;!-- wp:heading --\u0026gt;\n\u0026lt;h2\u0026gt;Why do I a VPN and why you should too\u0026lt;/h2\u0026gt;\n\u0026lt;!-- /wp:heading --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;All of us use an Internet Service Provider (ISP) of some description and all our internet traffic passes through their systems. That places them in a very powerful and informative position. They can see every page we visit and most of the data we enter into them.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;There is little to stop ISPs from selling this data on to whoever wants to buy it - anonomised or otherwise. There is nothing to stop them from injecting adverts directly into your traffic and straight into your browser.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;In the US there are numerous examples of ISPs having a complete disregard for their customers privacy and there is nothing to suggest the ISPs around the world are behaving any better.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Bear in mind that when I say \u0026#39;ISP\u0026#39;, that means whoever is providing your connection to the internet. That could be your directly connection, say to your home, or an indirect one via a public WiFi (secured or otherwise) offered by a coffee shop, hotel or airport.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Then there are the hackers who will use these or setup their own malicious WiFi access points with the sole purpose of harvesting your data, selling on or using it themselves.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;That is why I use a VPN as it is the best way to shield myself and my data from prying eyes while still being able to access the Internet.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;In basic terms a VPN wraps my traffic in a \u0026#39;tunnel\u0026#39; which my ISP cannot see into - all they see is a connection between me and one of my VPN providers servers. That server is where I emerge onto the internet (normally this would be my ISPs). From there I can navigate the internet as I normally would - but whoever is providing me with a connection to the internet won\u0026#39;t be able see of the data passing through it.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Now of course this means that my VPN provider will have all of the information that I just shielded from my ISP - so haven\u0026#39;t I just kicked the can down the road a bit here?\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Well yes I have but by carefully selecting my VPN provider carefully I can mitigate these concerns in a way that I could never do with my ISP.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;As mentioned above, I use ProtonVPN and have done for a number of years now. Because ProtonVPN is based in Switzerland they operate under some of the strongest privacy laws in the world. They also operate a \u0026#39;No Logs\u0026#39; policy which means that they do not record their users internet activity and therefore could not disclose it to third parties if they wanted (or were compelled) to.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Of course, I only have their word for that but at some point some trust has to be placed somewhere. What\u0026#39;s important here is that I have made this decision myself and if the circumstance arose that I was unhappy with my decision I could simple switch providers which is not quite so easy to do with my ISP.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:heading --\u0026gt;\n\u0026lt;h2\u0026gt;Would I recommend ProtonVPN?\u0026lt;/h2\u0026gt;\n\u0026lt;!-- /wp:heading --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;As mentioned above I\u0026#39;ve been using ProtonVPN for a few years now so surely I\u0026#39;m 100% happy with them an would be happy to recommend you do too ... wouldn\u0026#39;t I?\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Well as we all know things are never that straightforward and there have been times when I\u0026#39;ve tried other services - but never quite felt the need to move away.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;No service, internet or otherwise, is without it\u0026#39;s problems and ProtonVPN is no different. Over the years I\u0026#39;ve had numerous issues and even today, six months away from my renewal, I\u0026#39;m wondering if there is a better offering out there.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;The main issue is connection stability - especially on my phone. Sometimes when I try to navigate to a website or view my Twitter feed on my phone the connection just times out. So I disconnect from the VPN server and am now able to access the site or feed once more.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;But what also happens is that suddenly I start to receive emails and WhatsApp messages (when I still had WhatsApp that is) that have been waiting for my phone to reconnect to the internet. Some of these have been waiting for hours and I\u0026#39;ve been totally unaware of any issues with my connection.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Reconnecting didn\u0026#39;t hinder any further internet surfing, even when reconnecting to the same server so I\u0026#39;m not sure what actually happened here.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;I now find myself frequently disconnecting and reconnecting throughout the day - when I remember that is.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;It is also apparent that sometimes my connection doesn\u0026#39;t appear to be emerging onto the internet where I thought it would. Living in the UK I normally connect to the UK servers but sometimes it seems that websites think I\u0026#39;m connected from outside, e.g. Portugal or The Netherlands.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;This manifests itself by pages being displayed in a different language or my location being logged/reported from overseas or by the website blocking my altogether. Oddly the issue of being blocked is not consistent - sometimes I can access one of these sites, sometimes I can\u0026#39;t.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;So why don\u0026#39;t I just move to another service - I said above how easy it was after all.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;As my ProtonVPN subscription was coming up for renewal last year there was a lot of noise around \u0026lt;a href=\u0026quot;https://www.expressvpn.com/\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noreferrer noopener\u0026quot;\u0026gt;ExpressVPN\u0026lt;/a\u0026gt; so I decided to give it a look.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Initial inveistigations were promising, the range of server locations was extensive (when travelling I like to use servers as local to me as possible), the speeds were well up there and the range of applications meant that my Windows, MacOS and Android systems would be well served.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;But there was a problem and while it was somewhat trivial I suprised that something so trvial was even a problem.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;When I navigated to Twitter, no avatars were displayed. Disconnect the VPN and refresh the page and normal service was resumed. Reconnect and refresh and any non-cached avatars were missing from the page.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;I raised this with ExpressVPNs Support and while they were responsive and aware of the problem they were not able to provide a timeline for it\u0026#39;s resolution.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Trivial? Yes, absolutely but this was something so basic that it just jarred with me so I requested a refund under the terms of the account. To ExpressVPNs credit they made a few suggestions to try to resolve the issue but when these were unsuccessful they refunded my subscription in full and I remained with ProtonVPN.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;My ProtonVPN subscription is due for renewal in November and between now and then I will be trying to get to the bottom of the connection \u0026amp;amp; location issues that have plagued me. I\u0026#39;ll raise support calls and submit log files and see if we can get to the bottom of the problem.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:heading --\u0026gt;\n\u0026lt;h2\u0026gt;My Advice (for what it\u0026#39;s worth)\u0026lt;/h2\u0026gt;\n\u0026lt;!-- /wp:heading --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;While it\u0026#39;s not perfect putting up with ProtonVPNs little irritations is a small price to pay for the benefits I receive from it. When I\u0026#39;m using my phone abroad or in a hotel I can be sure that my traffic is not being gathered or intercepted.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;The one categorical thing I can say .. is that if you are not running a VPN then you should sign up for one now.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Don\u0026#39;t consider signing up for one of the many free services out there. Remember, as with so many things, these services cost money to run so if you aren\u0026#39;t paying anything to use it then they must be meeting those costs somehow and there is a chance that your data is the price you are paying.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Yes it\u0026#39;s true that ProtonVPN offers a free tier but it also restricts you to one connection (one device) at a time, the number of servers you can connect to and the speed you can expect from each. Personally I subscribe to the Plus tier but I also take the ProtonMail offering (also at the Plus level) as a bundled offering.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;If you want some suggestions then the \u0026lt;a href=\u0026quot;https://www.cnet.com/news/best-vpn/\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noreferrer noopener\u0026quot;\u0026gt;CNet Top VPN service of 2021\u0026lt;/a\u0026gt; would be a good place to start.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;",
    "Id": "205",
    "Permalink": "http://davecarson.me/2021/04/16/to-vpn-or-not-to-vpn/",
    "Created": "2021-04-16T08:00:00.0000000+00:00",
    "Author": "Dave Carson",
    "Title": "To VPN or not to VPN",
    "Categories": [
      "Privacy",
      "privacy infrastructure",
      "Technology"
    ]
  },
  {
    "Content": "\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;With so many cloud storage offerings these days it\u0026#39;s difficult to know what to use and sometimes you don\u0026#39;t even have a choice - if like me you use an Android phone your photos will probably make their way onto Google Photos. This is great if you want to be sure you have a back-up of your photos but remember, you are giving up nuggets of useful information - not least of which is the location where the photo was taken. \u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Now, it\u0026#39;s true that regardless of whether the photo gets sent to Google or not they will still know where I was by virtue of the fact that I have my phone with me and my cell carrier also knows my location for the same reason. But that doesn\u0026#39;t mean that I can\u0026#39;t take some control of my data - this isn\u0026#39;t about falling off the grid or trying to roam the Internet anonymously.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;We hand our data over to these online services, many of them offering free service tiers, without a second thought - until they suffer a data breach or some nafarious practice is revealed (normally the use or sale of this data for advertising and profiling).\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;If I run my email addresses through \u0026lt;a rel=\u0026quot;noreferrer noopener\u0026quot; href=\u0026quot;https://haveibeenpwned.com/\u0026quot; target=\u0026quot;_blank\u0026quot;\u0026gt;Have I Been Pwned\u0026lt;/a\u0026gt; I find that my details were in the 2012 Dropbox data breach and I find that a tad unsettling. Yes it was a few years ago but even though services are improving their security practices the bad guys are still finding their way in and exfiltrating data.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:heading --\u0026gt;\n\u0026lt;h2 id=\u0026quot;how-it-started\u0026quot;\u0026gt;How it started\u0026lt;/h2\u0026gt;\n\u0026lt;!-- /wp:heading --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;I\u0026#39;ve had a Synology network attached storage device (NAS) connected to my home network for a number of years and normally use it as a place to store family/holiday photos that I\u0026#39;ve taken and transferred via USB and important documents for my previous business and various system backups. I\u0026#39;ve used this to great effect to enable me to access this data from various PC and Mac systems in my home office without having to resort to USB keys and the like.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;This was great but when I was on the road I was cut off from this data and although it is possible to connect to the NAS via the Internet, login and access the files that way it was a fairly slow process and there was always the possibility of no/slow Internet.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Then one day I was listening to the \u0026lt;a rel=\u0026quot;noreferrer noopener\u0026quot; href=\u0026quot;https://twit.tv/shows/security-now\u0026quot; target=\u0026quot;_blank\u0026quot;\u0026gt;Security Now podcast on the Twit Network\u0026lt;/a\u0026gt; and heard Steve Gibson talk about his quest to find a way to sync documents between systems. Now, he ended up using Dropbox with a few tweaks but the podcast host, Leo Laporte, made a throwaway comment referring to Synology Drive which set me thinking - can I use that instead of Dropbox?\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Well as it turns out, yes I can! I can use it exactly like Dropbox.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;",
    "Id": "219",
    "Permalink": "http://davecarson.me/?p=219",
    "Created": "2021-04-16T08:00:00.0000000+00:00",
    "Author": "Dave Carson",
    "Title": "How I replaced Dropbox and Google Photos",
    "Categories": [
      "Privacy",
      "Technology"
    ]
  },
  {
    "Content": "\u0026lt;!-- wp:image {\u0026quot;align\u0026quot;:\u0026quot;left\u0026quot;,\u0026quot;id\u0026quot;:258,\u0026quot;sizeSlug\u0026quot;:\u0026quot;large\u0026quot;,\u0026quot;linkDestination\u0026quot;:\u0026quot;none\u0026quot;} --\u0026gt;\n\u0026lt;div class=\u0026quot;wp-block-image\u0026quot;\u0026gt;\u0026lt;figure class=\u0026quot;alignleft size-large\u0026quot;\u0026gt;\u0026lt;img src=\u0026quot;https://davecarsonme.files.wordpress.com/2021/08/protonmail-logo.png?w=225\u0026quot; alt=\u0026quot;\u0026quot; class=\u0026quot;wp-image-258\u0026quot; /\u0026gt;\u0026lt;/figure\u0026gt;\u0026lt;/div\u0026gt;\n\u0026lt;!-- /wp:image --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;We all know that all-things-technology change very quickly these days and email is no different. In my previous post I went all in on \u0026lt;a rel=\u0026quot;noreferrer noopener\u0026quot; href=\u0026quot;https://davecarson.me/2021/08/24/going-all-in-with-protonmail/\u0026quot; target=\u0026quot;_blank\u0026quot;\u0026gt;ProtonMail\u0026lt;/a\u0026gt;, citing it\u0026#39;s \u0026#39;privacy centric approach\u0026#39; to emails and it\u0026#39;s users data - and within a week they were all over the press because they had handed over IP addresses for some of it\u0026#39;s users to French law enforcement - who then promptly arrested said users.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;The tech press lost their minds over this and the internet was flooded with the usual click bait before any real information was known. Search for \u0026#39;protonmail French activists\u0026#39; and you will be sure to find plenty of results - the quality and accuracy of which will vary wildly.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;\u0026lt;a href=\u0026quot;https://protonmail.com/blog/climate-activist-arrest/\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noreferrer noopener\u0026quot;\u0026gt;ProtonMail published a blog post regarding the incident\u0026lt;/a\u0026gt; but this did little to quieten the tech press.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Now, I\u0026#39;m not going to go into details here but the fact of the matter (as I see it) is this;\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:quote --\u0026gt;\n\u0026lt;blockquote class=\u0026quot;wp-block-quote\u0026quot;\u0026gt;\u0026lt;p\u0026gt;ProtonMail is a legitimate company operating under Swiss Law and is not a Safe Harbor for illegal activities\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;\n\u0026lt;!-- /wp:quote --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;I should also make the following very, very clear;\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:quote --\u0026gt;\n\u0026lt;blockquote class=\u0026quot;wp-block-quote\u0026quot;\u0026gt;\u0026lt;p\u0026gt;Email is not, and was never intended to be, a secure method of communication across the Internet\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;\n\u0026lt;!-- /wp:quote --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;My decision to migrate from Google to Fastmail was based on the desire for privacy - Google made no secret that it was using my data for the purposes of selling me advertising and I\u0026#39;d grown uncomfortable with that.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;My recent decision to migrate from Fastmail to ProtonMail was two-fold,\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:list {\u0026quot;ordered\u0026quot;:true} --\u0026gt;\n\u0026lt;ol\u0026gt;\u0026lt;li\u0026gt;Improved privacy due to encrypted message content, attachments etc\u0026lt;/li\u0026gt;\u0026lt;li\u0026gt;More cost effective to merge multiple email domains into a single, management inbox\u0026lt;/li\u0026gt;\u0026lt;/ol\u0026gt;\n\u0026lt;!-- /wp:list --\u0026gt;\n\n\u0026lt;!-- wp:pullquote --\u0026gt;\n\u0026lt;figure class=\u0026quot;wp-block-pullquote\u0026quot;\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p\u0026gt;So, with all the above in mind - am I thinking about moving my email out of ProtonMail?\u0026lt;/p\u0026gt;\u0026lt;p\u0026gt;In a word - No!\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;\u0026lt;/figure\u0026gt;\n\u0026lt;!-- /wp:pullquote --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Nothing that ProtonMail have done has changed my opinion of their service or the security of my information stored within in. \u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;That said, I am not an activist, a journalist or someone else that requires a level of anonymity, beyond privacy, on the Internet to protect themselves and their associates from persecution and harm.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;During the Twitter storm I entered the fray to ask those what email service others were using - basically, if ProtonMail is so bad then what do they use that\u0026#39;s so good? Most never answer as they are probably using \u0026lt;a rel=\u0026quot;noreferrer noopener\u0026quot; href=\u0026quot;https://tutanota.com/\u0026quot; target=\u0026quot;_blank\u0026quot;\u0026gt;Tutanota\u0026lt;/a\u0026gt; (\u0026lt;a rel=\u0026quot;noreferrer noopener\u0026quot; href=\u0026quot;https://techcrunch.com/2020/12/08/german-secure-email-provider-tutanota-forced-to-monitor-an-account-after-regional-court-ruling\u0026quot; target=\u0026quot;_blank\u0026quot;\u0026gt;who have been similarly compelled by the German courts in the recent months\u0026lt;/a\u0026gt;) or maybe YahooMail - who knows (the missing Yahoo Mail link was not a mistake btw!)\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;One guy did however come back with a service called \u0026lt;a rel=\u0026quot;noreferrer noopener\u0026quot; href=\u0026quot;https://www.masq.ai/\u0026quot; target=\u0026quot;_blank\u0026quot;\u0026gt;MASQ\u0026lt;/a\u0026gt; that I hadn\u0026#39;t heard about so it\u0026#39;s worth noting that down here, even if its just so that I don\u0026#39;t forget the name if I ever decide to dig deeper.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;I skimmed over the website and it looks like a sort of mesh network where users become nodes within it. The site claims that;\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:quote --\u0026gt;\n\u0026lt;blockquote class=\u0026quot;wp-block-quote\u0026quot;\u0026gt;\u0026lt;p\u0026gt;\u0026quot;No large entity or Government could censor the network from allowing users to access the freedom of the entire Internet\u0026quot;\u0026lt;/p\u0026gt;\u0026lt;cite\u0026gt;MASQ Website (https://docs.masq.ai/masq/faq/intro-faqs)\u0026lt;/cite\u0026gt;\u0026lt;/blockquote\u0026gt;\n\u0026lt;!-- /wp:quote --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Now, I\u0026#39;ve not read into this nor am I an internet security expert but exactly how true that is in reality remains an open question. Afterall, if this latest incident with ProtonMail has taught us anything it\u0026#39;s that everything can be said to be 100% secure and private .... until it is tested and found to be only 90%.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;",
    "Id": "263",
    "Permalink": "http://davecarson.me/2021/09/24/protonmail-have-i-changed-my-mind/",
    "Created": "2021-09-24T15:03:16.0000000+00:00",
    "Author": "Dave Carson",
    "Title": "ProtonMail - Have I changed my mind?",
    "Categories": [
      "Privacy",
      "Technology"
    ]
  },
  {
    "Content": "\u0026lt;!-- wp:image {\u0026quot;align\u0026quot;:\u0026quot;left\u0026quot;,\u0026quot;id\u0026quot;:319,\u0026quot;sizeSlug\u0026quot;:\u0026quot;large\u0026quot;,\u0026quot;linkDestination\u0026quot;:\u0026quot;none\u0026quot;} --\u0026gt;\n\u0026lt;figure class=\u0026quot;wp-block-image alignleft size-large\u0026quot;\u0026gt;\u0026lt;img src=\u0026quot;https://davecarsonme.files.wordpress.com/2022/04/privacy.jpg?w=320\u0026quot; alt=\u0026quot;\u0026quot; class=\u0026quot;wp-image-319\u0026quot; /\u0026gt;\u0026lt;/figure\u0026gt;\n\u0026lt;!-- /wp:image --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Our email address is online gold. With it online retailers can contact you with offers and updates, whether you are interested in them or not, while the scammers and phishers can use it to relieve you of your money and maybe your identity.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Using your email address to register with online services means that if they decide to sell your details or suffer a data breach then the primary key to your online life will be in the hands of people who don\u0026#39;t have your best interests at heart.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;I don\u0026#39;t use this davecarson.me domain for any email accounts, at all, but suppose I created an email address of \u0026lt;strong\u0026gt;me@davecarson.me\u0026lt;/strong\u0026gt; and used it to register with an online service who then sold my details to a marketing company. Whether that company then either used it in a spamming campaign or sell it on to someone who does doesn\u0026#39;t really matter - the result is more viagra emails in my inbox.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;So how can we get around this problem - we have to give them our email address ....... don\u0026#39;t we?\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Well, no we don\u0026#39;t. We need to give them \u0026lt;strong\u0026gt;an\u0026lt;/strong\u0026gt; email address - preferably one that we can receive use to send and receive messages.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;But surely we can\u0026#39;t have an email address for every service we want to sign up to - that would be madness and a maintenance nightmare.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:heading {\u0026quot;level\u0026quot;:3} --\u0026gt;\n\u0026lt;h3\u0026gt;The simple \u0026#39;+\u0026#39; alias:\u0026lt;/h3\u0026gt;\n\u0026lt;!-- /wp:heading --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Most email services out there will allow you to create a \u0026#39;+\u0026#39; alias on the fly, i.e. you don\u0026#39;t need to set anything up ahead of time.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;So for my example email address above I could use something like \u0026lt;strong\u0026gt;me+reddit@davecarson.me\u0026lt;/strong\u0026gt; to register with Reddit and any emails sent to it would be received into the same inbox as the regular account.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;(note that I\u0026#39;m using saying that Reddit are guilty of poor practices - I just picked them from my bookmark bar)\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;If I started to get spam emails to that email address then I would know that it had been compromised somehow. I could then take action to mitigate the incoming spam somehow - maybe changing the email address with the service and/or adding inbox filters.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:heading {\u0026quot;level\u0026quot;:3} --\u0026gt;\n\u0026lt;h3\u0026gt;Email Forwarding:\u0026lt;/h3\u0026gt;\n\u0026lt;!-- /wp:heading --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;One problem with the + alias is that your actual email address is right there and easily parsed to remove the anything between the + and the @ - essentially, \u0026lt;strong\u0026gt;me@davecarson.me\u0026lt;/strong\u0026gt; would need to be a valid email address so you kinda gave it to them anyway.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;A popular alternative is to sign up to an Email Forwarding service like \u0026lt;a rel=\u0026quot;noreferrer noopener\u0026quot; href=\u0026quot;https://anonaddy.com/\u0026quot; target=\u0026quot;_blank\u0026quot;\u0026gt;AnonAddy\u0026lt;/a\u0026gt; - my current service of choice. Now - let\u0026#39;s address the elephant in the room, at some point you will need to disclose your primary email address to some service or other (unless you want to self-host a solution). I\u0026#39;ve trusted AnonAddy with mine and have no reason to think that was a bad idea.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;After signing up you will be able to create email addresses using a range of domains, e.g. \u0026lt;strong\u0026gt;reddit@foo.anonaddy.me\u0026lt;/strong\u0026gt; or \u0026lt;strong\u0026gt;reddit@foo.mailer.me\u0026lt;/strong\u0026gt; (in these examples \u0026#39;foo\u0026#39; indicates a personal subdomain within which you can create your addresses - yours would not be foo).\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;As there is no element of your primary email address here if cannot be gleaned or guessed.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;With most forwarding providers allowing the use of your own custom domains so if I so desired I could do this and be able to create \u0026lt;strong\u0026gt;reddit@davecarson.me\u0026lt;/strong\u0026gt; and have it forward to your primary inbox. This would overcome situations where services have blocked the \u0026lt;strong\u0026gt;anonaddy.me\u0026lt;/strong\u0026gt; or \u0026lt;strong\u0026gt;mailer.me\u0026lt;/strong\u0026gt; domains.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:heading {\u0026quot;level\u0026quot;:3} --\u0026gt;\n\u0026lt;h3\u0026gt;\u0026lt;strong\u0026gt;But the solution isn\u0026#39;t perfect\u0026lt;/strong\u0026gt;\u0026lt;/h3\u0026gt;\n\u0026lt;!-- /wp:heading --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Recently I have run into problems when attempting to register with certain services and retailers using my custom domain via AnonAddy - and I\u0026#39;m just a little knarked about it, hence this post.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;I recently tried to register with an online finance company to view details of my vehicle finance plan. But their site just displayed a random error message saying there was a problem and that I should try again.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;I tried turning off my VPN (which has caused issues like this - another blog post I suspect) but no joy. Eventually I tried just entering my primary email address and voila - registration complete so it was something about my email address that they didn\u0026#39;t like. \u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;As this company had plenty of my information already, I have car finance with them, I wasn\u0026#39;t too worried about giving them my email - it\u0026#39;s a value judgement really.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;But it got me thinking - why didn\u0026#39;t it like my aliasing address? It\u0026#39;s perfectly valid and properly configured with all the required DNS records in place. With no further information available I moved on.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;More recently I wanted to buy something from the UK retailer \u0026lt;a rel=\u0026quot;noreferrer noopener\u0026quot; href=\u0026quot;https://www.argos.co.uk/\u0026quot; target=\u0026quot;_blank\u0026quot;\u0026gt;Argos\u0026lt;/a\u0026gt; via their website using a gift card I had received. With the item in my shopping trolly I went to the checkout .. where I was required to register my details to create an account. While I think that the information collected was a tad excessive considering I was paying in advance to collect the item from one of their stores I thought; no problem, I\u0026#39;ll just create \u0026lt;strong\u0026gt;argos@mydomain.email\u0026lt;/strong\u0026gt; and place my order.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Well, no ... that\u0026#39;s not going to work - because my custom domain ends with .email and Argos will only accept those with a maximum of 3 characters after that last dot, e.g. .com, .co.uk, .net etc.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:image {\u0026quot;id\u0026quot;:310,\u0026quot;sizeSlug\u0026quot;:\u0026quot;large\u0026quot;,\u0026quot;linkDestination\u0026quot;:\u0026quot;none\u0026quot;} --\u0026gt;\n\u0026lt;figure class=\u0026quot;wp-block-image size-large\u0026quot;\u0026gt;\u0026lt;img src=\u0026quot;https://davecarsonme.files.wordpress.com/2022/04/image.png?w=786\u0026quot; alt=\u0026quot;\u0026quot; class=\u0026quot;wp-image-310\u0026quot; /\u0026gt;\u0026lt;/figure\u0026gt;\n\u0026lt;!-- /wp:image --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;It didn\u0026#39;t stop there either - I decided to fall back to using a simple + alias on my primary email (with a three character suffix) but that was rejected as well.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:image {\u0026quot;align\u0026quot;:\u0026quot;center\u0026quot;,\u0026quot;id\u0026quot;:312,\u0026quot;sizeSlug\u0026quot;:\u0026quot;large\u0026quot;,\u0026quot;linkDestination\u0026quot;:\u0026quot;none\u0026quot;} --\u0026gt;\n\u0026lt;figure class=\u0026quot;wp-block-image aligncenter size-large\u0026quot;\u0026gt;\u0026lt;img src=\u0026quot;https://davecarsonme.files.wordpress.com/2022/04/image-1.png?w=567\u0026quot; alt=\u0026quot;\u0026quot; class=\u0026quot;wp-image-312\u0026quot; /\u0026gt;\u0026lt;/figure\u0026gt;\n\u0026lt;!-- /wp:image --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;No \u0026#39;real\u0026#39; technical reason, just some arbitory decision made and not challenged by whoever coded that validation.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;If I wasn\u0026#39;t using a giftcard for the purchase I would probably have gone elsewhere. \u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;What I shouild have done, and the main takeaway for me in all this, would be to try one of the Shared Domains offered by AnonAddy. I totally forgot this was possible and ended up having to use my primary email address. (for what it\u0026#39;s worth I\u0026#39;ve since logged back in and updated it with a \u0026lt;strong\u0026gt;mailer.me \u0026lt;/strong\u0026gt;address)\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Another example is \u0026lt;a rel=\u0026quot;noreferrer noopener\u0026quot; href=\u0026quot;https://www.currys.co.uk/\u0026quot; target=\u0026quot;_blank\u0026quot;\u0026gt;Currys\u0026lt;/a\u0026gt;, where I\u0026#39;m already registered, who sent me a \u0026#39;How did we do\u0026#39; survey email this morning. The email was sent to my own \u0026lt;strong\u0026gt;.email\u0026lt;/strong\u0026gt; domain, via AnonAddy, but when I tried to login to my account it was flagged as invalid so the \u0026#39;Login\u0026#39; button remained disabled - same for the forgotten email page.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:image {\u0026quot;id\u0026quot;:309,\u0026quot;sizeSlug\u0026quot;:\u0026quot;large\u0026quot;,\u0026quot;linkDestination\u0026quot;:\u0026quot;none\u0026quot;} --\u0026gt;\n\u0026lt;figure class=\u0026quot;wp-block-image size-large\u0026quot;\u0026gt;\u0026lt;img src=\u0026quot;https://davecarsonme.files.wordpress.com/2022/04/currys-email-validation.png?w=1000\u0026quot; alt=\u0026quot;\u0026quot; class=\u0026quot;wp-image-309\u0026quot; /\u0026gt;\u0026lt;/figure\u0026gt;\n\u0026lt;!-- /wp:image --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;If I trim the last character off the email address - then the validation error disappears and the button is enabled. So Currys are blocking email addresses with domains having a suffix of more than 4 characters. Again - there is no technical reason for this (I\u0026#39;m a software developer so I\u0026#39;m pretty comfortable stating that) - just a stupid decision made with little rationale (unless it\u0026#39;s deliberate and they want to restrict our options and dilute our control over our inboxes - I\u0026#39;ll leave that one with you ;-))\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:heading {\u0026quot;level\u0026quot;:3} --\u0026gt;\n\u0026lt;h3\u0026gt;Conclusion\u0026lt;/h3\u0026gt;\n\u0026lt;!-- /wp:heading --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;I\u0026#39;ve learnt a few important lessons recently\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:list --\u0026gt;\n\u0026lt;ul\u0026gt;\u0026lt;li\u0026gt;Check if your primary email provider allows + aliases and use them if they do\u0026lt;/li\u0026gt;\u0026lt;li\u0026gt;Consider using a forwarding service\u0026lt;ul\u0026gt;\u0026lt;li\u0026gt;I\u0026#39;m happy to recommend AnonAddy but others are out there\u0026lt;/li\u0026gt;\u0026lt;li\u0026gt;If you decide to use a custom domain purely for your emails, get one with a three character suffix\u0026lt;/li\u0026gt;\u0026lt;li\u0026gt;If your service provides Shared Domains, bear them in mind if the site you are signing up to pushes back - although this shouldn\u0026#39;t happen if you don\u0026#39;t get \u0026#39;smart\u0026#39; with your selected custom domain.\u0026lt;/li\u0026gt;\u0026lt;/ul\u0026gt;\u0026lt;/li\u0026gt;\u0026lt;li\u0026gt;People in my profession make stupid decisions\u0026lt;/li\u0026gt;\u0026lt;/ul\u0026gt;\n\u0026lt;!-- /wp:list --\u0026gt;\n\n\u0026lt;!-- wp:heading {\u0026quot;level\u0026quot;:3} --\u0026gt;\n\u0026lt;h3\u0026gt;Follow up\u0026lt;/h3\u0026gt;\n\u0026lt;!-- /wp:heading --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;I contacted Currys via Twitter and their advice was to \u0026#39;try another device and/or clear my cookies\u0026#39;\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:image {\u0026quot;align\u0026quot;:\u0026quot;center\u0026quot;,\u0026quot;id\u0026quot;:316,\u0026quot;sizeSlug\u0026quot;:\u0026quot;large\u0026quot;,\u0026quot;linkDestination\u0026quot;:\u0026quot;none\u0026quot;} --\u0026gt;\n\u0026lt;figure class=\u0026quot;wp-block-image aligncenter size-large\u0026quot;\u0026gt;\u0026lt;img src=\u0026quot;https://davecarsonme.files.wordpress.com/2022/04/image-2.png?w=588\u0026quot; alt=\u0026quot;\u0026quot; class=\u0026quot;wp-image-316\u0026quot; /\u0026gt;\u0026lt;/figure\u0026gt;\n\u0026lt;!-- /wp:image --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;At least they stopped short of telling me to try restarting my computer :-)\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;",
    "Id": "295",
    "Permalink": "http://davecarson.me/2022/04/04/email-aliasing-lessons-learned/",
    "Created": "2022-04-04T07:57:53.0000000+00:00",
    "Author": "Dave Carson",
    "Title": "Email Aliasing - Lessons Learned",
    "Categories": [
      "Privacy",
      "Technology"
    ]
  },
  {
    "Content": "\u0026lt;!-- wp:syntaxhighlighter/code {\u0026quot;language\u0026quot;:\u0026quot;csharp\u0026quot;} --\u0026gt;\n\u0026lt;pre class=\u0026quot;wp-block-syntaxhighlighter-code\u0026quot;\u0026gt;public function HasBlock() {\n    return true;\n}\u0026lt;/pre\u0026gt;\n\u0026lt;!-- /wp:syntaxhighlighter/code --\u0026gt;",
    "Id": "330",
    "Permalink": "http://davecarson.me/?p=330",
    "Created": "2022-04-04T07:57:53.0000000+00:00",
    "Author": "Dave Carson",
    "Title": "",
    "Categories": [
      "Uncategorized"
    ]
  }
]