[
  {
    "Content": "\u0026lt;!-- wp:image {\u0026quot;align\u0026quot;:\u0026quot;left\u0026quot;,\u0026quot;id\u0026quot;:258,\u0026quot;sizeSlug\u0026quot;:\u0026quot;large\u0026quot;,\u0026quot;linkDestination\u0026quot;:\u0026quot;none\u0026quot;} --\u0026gt;\n\u0026lt;div class=\u0026quot;wp-block-image\u0026quot;\u0026gt;\u0026lt;figure class=\u0026quot;alignleft size-large\u0026quot;\u0026gt;\u0026lt;img src=\u0026quot;https://davecarsonme.files.wordpress.com/2021/08/protonmail-logo.png?w=225\u0026quot; alt=\u0026quot;\u0026quot; class=\u0026quot;wp-image-258\u0026quot; /\u0026gt;\u0026lt;/figure\u0026gt;\u0026lt;/div\u0026gt;\n\u0026lt;!-- /wp:image --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;A couple of years ago I finally \u0026lt;a rel=\u0026quot;noreferrer noopener\u0026quot; href=\u0026quot;https://davecarson.me/2019/02/18/goodbye-gmail-step-1-anyway/\u0026quot; target=\u0026quot;_blank\u0026quot;\u0026gt;took the plunge and moved away from GMail\u0026lt;/a\u0026gt;, choosing instead to use a provider that wasn\u0026#39;t using it to target me with advertising. Of course, I had to pay for the privilege but then I believed that it was a price worth paying - and I still believe that today.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;So why am I moving yet again? Was there something wrong with the service I received from my new provider, \u0026lt;a href=\u0026quot;https://www.fastmail.com\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noreferrer noopener\u0026quot;\u0026gt;Fastmail\u0026lt;/a\u0026gt;?\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Well, no. There was absolutely nothing wrong with Fastmail and I have had a couple of (almost) trouble free years using them for my personal and business email hosting. \u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Sure, their Android app has its shortcomings - not least of which was it\u0026#39;s inability to access emails when I was offline, i.e. emails that I had previously downloaded (and maybe even read) prior to losing connection. I normally bumped into this when I was getting on a plane and had to turn on flight mode. To overcome this I just installed the Spark email client on my phone and that was that.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;The move from Fastmail to ProtonMail was basically triggered by a number of factors:\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:list --\u0026gt;\n\u0026lt;ul\u0026gt;\u0026lt;li\u0026gt;I already had a ProtonMail account which I registered some years ago but never got around to using (initially a free account but now a paid bundle which includes their VPN offering)\u0026lt;/li\u0026gt;\u0026lt;li\u0026gt;I still want to receive emails into what was my business inbox and need access to previous emails etc.\u0026lt;ul\u0026gt;\u0026lt;li\u0026gt;While I\u0026#39;m not running my business anymore I am retaining the internet domain which is has now returned to being my technical blogging platform.\u0026lt;/li\u0026gt;\u0026lt;/ul\u0026gt;\u0026lt;/li\u0026gt;\u0026lt;li\u0026gt;I was essentially paying almost $180 annually for three inboxes\u0026lt;ul\u0026gt;\u0026lt;li\u0026gt;My primary personal inbox with Fastmail ($60/yr)\u0026lt;/li\u0026gt;\u0026lt;li\u0026gt;My business inbox with Fastmail which receives very little in the way of new messages but is a few GB in size ($60/yr)\u0026lt;/li\u0026gt;\u0026lt;li\u0026gt;My (essentially dormant) ProtonMail account which had only ever received emails from PM themselves or from one the above accounts when I was testing the use of PGP certificates using the Thunderbird email client (\u0026#226;‚\u0026#172;48 ~ $56/yr)\u0026lt;/li\u0026gt;\u0026lt;/ul\u0026gt;\u0026lt;/li\u0026gt;\u0026lt;/ul\u0026gt;\n\u0026lt;!-- /wp:list --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;While that\u0026#39;s not a massive amount of money it is an unecessary outgoing and with my circumstances having recently changed I was taking a good look at my finances. It was fairly clear that I was essentially throwing money away here - so something had to give.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:heading {\u0026quot;level\u0026quot;:3} --\u0026gt;\n\u0026lt;h3\u0026gt;A quick overview of ProtonMail\u0026lt;/h3\u0026gt;\n\u0026lt;!-- /wp:heading --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;You can read more about \u0026lt;a rel=\u0026quot;noreferrer noopener\u0026quot; href=\u0026quot;https://protonmail.com\u0026quot; target=\u0026quot;_blank\u0026quot;\u0026gt;ProtonMail\u0026lt;/a\u0026gt; on their website but they are privacy centric, based in Switzerland and offer email encryption as out of the box such that they are unable to access your messages themselves. That is to say that emails are encrypted on their servers and they do not have the necessary keys to decrypt them.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Having messages encrypted at rest, e.g. on your email hosts servers, is one step towards protecting your communications, it is when they are in transit that they are probably the most vulnerable.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Think of sending regular email being akin to sending a postcard, i.e. it\u0026#39;s can be read quite easily by people other than the intended recipient while in transit.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;To overcome this you would need to encrypt your messages \u0026lt;strong\u0026gt;before \u0026lt;/strong\u0026gt;you sent them - which would require an amount of configuration within your email client and the exchange of public keys between yourself and the recipient. All perfectly doable, if a little bit techie, and \u0026lt;a href=\u0026quot;https://support.mozilla.org/en-US/kb/openpgp-thunderbird-howto-and-faq\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noreferrer noopener\u0026quot;\u0026gt;becoming easier with clients such as Thunderbird\u0026lt;/a\u0026gt;.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;ProtonMail greases the wheels here whereby if you are sending emails to another ProtonMail user they will be end-to-end encrypted between sender and recipient - and of course at rest.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;If you are \u0026lt;a href=\u0026quot;https://protonmail.com/support/knowledge-base/encrypt-for-outside-users/\u0026quot; target=\u0026quot;_blank\u0026quot; rel=\u0026quot;noreferrer noopener\u0026quot;\u0026gt;sending emails to someone not using ProtonMail\u0026lt;/a\u0026gt; then they offer the facility to encrypt the message before sending it, applying a password that you can communicate to the recipient or use a hint to enable them to work it out. The recipient will receive an email containing a link (so you may want to tell them to expect it and that it is safe to click it!). They will be taken to the ProtonMail website where they can enter the password and view the content of the message and even reply to it directly from the browser with the same level of encryption.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Don\u0026#39;t want to use the web portal? Well, that\u0026#39;s not a problem either. I\u0026#39;m a bit of a fossil in some respects so do prefer to use a desktop client to send email instead of pecking away at my phone. But what happens to all this encryption now?\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;Well, I am using Thunderbird (on PC and Mac) and the \u0026lt;a rel=\u0026quot;noreferrer noopener\u0026quot; href=\u0026quot;https://protonmail.com/bridge/\u0026quot; target=\u0026quot;_blank\u0026quot;\u0026gt;ProtonMail Bridge\u0026lt;/a\u0026gt; application comes into play here. Available for PC, MacOS and Linux it installs locally and sits between the client (doesn\u0026#39;t have to be Thunderbird btw) and the ProtonMail servers ensuring secure communications between the two.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;It\u0026#39;s worth noting that the Bridge application is only available to Paid users but if you are happy using the web portal then you don\u0026#39;t need it and the Free account could serve you well enough.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:heading {\u0026quot;level\u0026quot;:3} --\u0026gt;\n\u0026lt;h3\u0026gt;My Migration\u0026lt;/h3\u0026gt;\n\u0026lt;!-- /wp:heading --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;It\u0026#39;s worth pointing out at this point that ProtonMail doesn\u0026#39;t offer absolutely everything that I was getting from Fastmail but I\u0026#39;ve made the decision that I can live with the shortcomings for now (and maybe for good). I\u0026#39;ll raise some feature requests to ProtonMail \u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;In particular these are:\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:list --\u0026gt;\n\u0026lt;ul\u0026gt;\u0026lt;li\u0026gt;No CalDAV on their Calendar offering which means I can\u0026#39;t integrate directly with my desktop client, Thunderbird. This isn\u0026#39;t a showstopper as such but as already mentioned, I\u0026#39;m a bit of a fossil when it comes to desktop clients so would prefer to use it.\u0026lt;ul\u0026gt;\u0026lt;li\u0026gt;I\u0026#39;ve resolved this for the timebeing by standing up my own CalDAV server on a spare RaspberryPi that I had to hand but this won\u0026#39;t be an option for everyone.\u0026lt;/li\u0026gt;\u0026lt;/ul\u0026gt;\u0026lt;/li\u0026gt;\u0026lt;li\u0026gt;The Calendar doesn\u0026#39;t offer \u0026#39;remind by email\u0026#39; - only as a notification via the web portal and their standalone mobile application.\u0026lt;/li\u0026gt;\u0026lt;li\u0026gt;Rules and filters are lacking a few actions I like to use, in particular matching on message body content and forwarding of messages to another email address.\u0026lt;/li\u0026gt;\u0026lt;/ul\u0026gt;\n\u0026lt;!-- /wp:list --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;None of these are what you could call show-stoppers but something I would like to see added to the product in due course - I will be sending these feature requests to ProtonMail by whatever channels they have made available.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;The migration itself was pretty straightforward using the \u0026lt;a rel=\u0026quot;noreferrer noopener\u0026quot; href=\u0026quot;https://protonmail.com/blog/import-export-app-release/\u0026quot; target=\u0026quot;_blank\u0026quot;\u0026gt;ProtonMail Import-Export application\u0026lt;/a\u0026gt;, it took a while but it pulled everything over (I didn\u0026#39;t have to sit there and wait for it to finish - it just got on with it).\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:heading {\u0026quot;level\u0026quot;:3} --\u0026gt;\n\u0026lt;h3\u0026gt;Two Months Later\u0026lt;/h3\u0026gt;\n\u0026lt;!-- /wp:heading --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;I\u0026#39;ve been using ProtonMail for my primary address for a couple of months now and while there have been a few bumps in the road I am generally happy with the move - my other domain will be following shortly.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;I\u0026#39;ve experienced a few issues with the Bridge application on my Windows workstation - mainly start up issues caused by the VPN (also a Proton offering) still connecting and blocking all outgoing connection. There is an open support ticket for this so hopefully they will resolve this shortly.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;That said, I\u0026#39;m wondering if I\u0026#39;m a bit of a dinosaur using desktop email clients - currently a mixture of Outlook and Thunderbird - and whether I should just use the web applications instead. I have the ProtonMail app on my phone and they have one for their calendar as well. \u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;If I used their supplied applications (web and mobile) then all the \u0026#39;pain\u0026#39; I have with CalDAV, CardDAV and the Bridge would go away. Maybe I\u0026#39;m making things hard for myself and I need to drop my reliance on desktop apps - after all, the data is \u0026#39;in the [encrypted] cloud\u0026#39; anyway so why do I feel the need to pull it down to my PC where it is certainly more vulnerable.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:heading {\u0026quot;level\u0026quot;:3} --\u0026gt;\n\u0026lt;h3\u0026gt;Grab yourself some Free Privacy\u0026lt;/h3\u0026gt;\n\u0026lt;!-- /wp:heading --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;I\u0026#39;m a paid user or ProtonMail and ProtonVPN - but they have free versions of both these services. Yes they have some limitations but the core services are there.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;\u0026lt;a rel=\u0026quot;noreferrer noopener\u0026quot; href=\u0026quot;https://protonmail.com/signup\u0026quot; target=\u0026quot;_blank\u0026quot;\u0026gt;A Free ProtonMail\u0026lt;/a\u0026gt; account will currently provide you with 500MB of storage and 150 messages a day while the \u0026lt;a rel=\u0026quot;noreferrer noopener\u0026quot; href=\u0026quot;https://protonvpn.com/pricing\u0026quot; target=\u0026quot;_blank\u0026quot;\u0026gt;Free ProtonVPN\u0026lt;/a\u0026gt; service will provide access to 23 servers in 3 countries. \u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:paragraph --\u0026gt;\n\u0026lt;p\u0026gt;These are no risk options allowing you to try them out and see if they will work for you or not. If they do and you want additional features then the paid tiers are quite affordable. Otherwise you can just walk away with your only investment being a bit of your time.\u0026lt;/p\u0026gt;\n\u0026lt;!-- /wp:paragraph --\u0026gt;\n\n\u0026lt;!-- wp:pullquote --\u0026gt;\n\u0026lt;figure class=\u0026quot;wp-block-pullquote\u0026quot;\u0026gt;\u0026lt;blockquote\u0026gt;\u0026lt;p\u0026gt;Remember - we all have things we don\u0026#39;t want others to see, that doesn\u0026#39;t mean it\u0026#39;s illegal, just that it\u0026#39;s private.\u0026lt;/p\u0026gt;\u0026lt;/blockquote\u0026gt;\u0026lt;/figure\u0026gt;\n\u0026lt;!-- /wp:pullquote --\u0026gt;",
    "Id": "237",
    "Permalink": "http://davecarson.me/2021/08/24/going-all-in-with-protonmail/",
    "Created": "2021-08-24T07:48:29.0000000+00:00",
    "Author": "Dave Carson",
    "Title": "Going all in with ProtonMail",
    "Categories": [
      "Life",
      "Privacy"
    ]
  }
]
